{
    "4005": "Jessica walked into the kitchen while Michael stayed silent. Jessica then moved to the living room and asked, \"Do you have any idea where the remote control might be?\" Michael, who had just walked into the kitchen, replied, \"I found the remote control inside the cabinet in the living room.\" Jessica walked to the cabinet, opened it, grabbed the remote control, and closed the cabinet. She then walked to the sofa and placed the remote control on it.\n\nMeanwhile, Michael walked to the fridge, opened it, grabbed the milk, and closed the fridge. He then opened the microwave and placed the milk inside before closing it.\n\nJessica and Michael completed their tasks without further communication.",
    "4009": "Mary walked into the kitchen and then headed to the bathroom. Meanwhile, John entered the kitchen. Mary returned to the kitchen and walked towards a kitchen cabinet. John moved to another kitchen cabinet, opened it, and grabbed a potato. Mary then walked to the fridge and asked, \"Any idea where the wine might be?\" John replied, \"I found the wine inside the kitchen cabinet,\" as he closed the kitchen cabinet.\n\nMary opened the fridge, grabbed the wine, and closed the fridge. John continued his task by putting the potato inside the kitchen cabinet.",
    "4017": "Michael walked to the microwave and opened the fridge. Meanwhile, Sarah walked into the living room. Michael closed the fridge and asked, \"Do you know where the toy is?\" as he walked back to the microwave. Sarah responded, \"I found a toy inside the microwave in the kitchen,\" while grabbing a magazine. Michael opened and closed the microwave, then walked to the living room and grabbed the toy. Sarah walked to the kitchen, then to the bedroom, and placed the magazine on the coffee table.",
    "4018": "Michael and Jessica both walked into the kitchen. Michael asked, \"Any idea where the remote control might be?\" as he moved towards a kitchen cabinet. Jessica replied, \"I found the remote control on the coffee table in the bedroom,\" while heading to the same kitchen cabinet. Michael then walked to the bedroom and grabbed the remote control. Meanwhile, Jessica opened the kitchen cabinet, grabbed a spoon, and closed the cabinet. Michael walked to the living room and put the remote control back on the sofa.",
    "4023": "Michael and Sarah both walked into the kitchen. Michael then walked to the stove while Sarah headed to a kitchen cabinet. \"Any idea where the wine might be?\" Michael asked. Sarah replied, \"I found the wine inside the bathroom cabinet,\" as she opened the kitchen cabinet and grabbed a juice. Michael walked to the bathroom and opened the bathroom cabinet, while Sarah closed the kitchen cabinet and put the juice back on the kitchen counter. Michael then closed the bathroom cabinet and walked to the bedroom, where he grabbed the wine.",
    "4034": "Michael walked into the kitchen while Jessica headed to the living room. Michael then moved to the living room and back to the kitchen, asking, \"Do you know where the beer is?\" Jessica replied, \"I found the beer inside the stove in the kitchen,\" while walking towards the remote control. Michael walked to the stove, opened it, and then closed it after not finding the beer. He then walked back to the living room and approached a cabinet. Meanwhile, Jessica grabbed the remote control and walked to the same cabinet. She opened it and placed the remote control inside, then closed the cabinet. Michael opened the cabinet, grabbed the beer, and closed it.\n\nMichael walked into the kitchen, then to the living room, and back to the kitchen, asking Jessica about the beer. Jessica, in the living room, found the remote control and placed it in the cabinet. Michael checked the stove, then went to the living room, found the beer in the cabinet, and took it.",
    "4037": "Michael walked into the kitchen. \"Do you know where the milk is?\" he asked. Jessica, who was opening a kitchen cabinet, replied, \"I found the milk inside the cabinet in the living room.\" Michael then walked to the living room and approached the cabinet. Meanwhile, Jessica grabbed a bread from the kitchen cabinet and closed it. \n\nMichael opened the cabinet in the living room, but then closed it and returned to the kitchen. Jessica opened another kitchen cabinet and put the bread inside, closing it afterward. Michael walked to the microwave in the kitchen, opened it, and grabbed the milk. He then closed the microwave.",
    "4041": "Michael walked to a kitchen cabinet, then moved to another kitchen cabinet and opened it. Meanwhile, Sarah walked from the bedroom to the kitchen. Michael closed the kitchen cabinet and asked, \"Do you know where the folder is?\" Sarah replied, \"I found a folder on the coffee table in the living room,\" and then walked back to the bedroom. Michael walked to the living room and grabbed the folder from the coffee table. He then walked back to the kitchen and placed the folder on the kitchen table. \n\nSimultaneously, Sarah grabbed a wineglass from the bedroom and walked to the kitchen. She then moved to a kitchen cabinet, opened it, and placed the wineglass inside.",
    "4043": "Michael walked from the bathroom to the kitchen and then to a kitchen cabinet. He opened the cabinet and closed it, then opened the microwave and closed it. Meanwhile, Sarah walked from the bedroom and grabbed a toy. She then walked to the kitchen. Michael asked, \"Do you know where the juice is?\" as he opened another kitchen cabinet. Sarah replied, \"I found the juice inside the microwave in the kitchen,\" while walking to the living room. Michael grabbed the juice from the kitchen cabinet and closed it, while Sarah put the toy back on the sofa.\n\nMichael walked from the bathroom to the kitchen and checked a kitchen cabinet, then the microwave, and finally another kitchen cabinet where he found the juice. Sarah moved from the bedroom to the kitchen, then to the living room, placing the toy on the sofa.",
    "4054": "Michael walked into the kitchen and headed to a kitchen cabinet. Meanwhile, Jessica walked into the living room and approached a book. Michael opened the kitchen cabinet, then closed it, and asked, \"Do you happen to know where the juice is?\" Jessica grabbed the book and replied, \"I found the juice inside the fridge in the kitchen,\" as she walked towards the kitchen.\n\nMichael walked to the fridge, opened it, and grabbed the juice. He then closed the fridge. Jessica walked to the bedroom, then to the desk, and put the book on it.",
    "4057": "Michael walked to the microwave. Meanwhile, Sarah entered the kitchen. Michael asked, \"Do you know where the juice is?\" as he stood by the microwave. Sarah replied, \"I found the juice inside the microwave in the kitchen,\" while walking towards the living room. Michael opened the microwave, found it empty, and closed it. He then walked to the fridge, opened it, and grabbed the juice. Afterward, he closed the fridge.\n\nSimultaneously, Sarah walked to a cabinet in the living room, opened it, and grabbed a cellphone. She closed the cabinet and walked to the sofa, where she placed the cellphone.\n\nMichael walked to the microwave and asked Sarah about the juice. Sarah mentioned it was in the microwave, but Michael found it in the fridge. Sarah retrieved the cellphone from the cabinet and placed it on the sofa.",
    "4059": "Kevin walked into the kitchen and moved towards a kitchen cabinet. Meanwhile, Jessica walked from the bedroom and grabbed a spoon. Kevin then walked to the stove, opened it, and asked, \"Do you know where the beer is?\" Jessica, now heading to the kitchen, replied, \"I found the beer inside the microwave in the kitchen,\" as she walked to the kitchen counter and put the spoon down.\n\nKevin closed the stove and walked to the microwave, opening and closing it without finding the beer. He then opened the fridge, grabbed the beer, and closed the fridge.",
    "4063": "John walked to the microwave, opened it, and then closed it. Meanwhile, Mary walked into the kitchen and headed to the fridge. John opened a kitchen cabinet and then closed it, asking, \"Any idea where the carrot might be?\" Mary replied, \"I found a carrot inside the kitchen cabinet,\" as she opened the fridge. John walked to the stove, opened it, and grabbed the carrot from inside, then closed the stove. Mary closed the fridge, walked to the kitchen cabinet, opened it, grabbed the milk, and then closed the cabinet.",
    "4070": "Kevin walked into the kitchen and headed to a kitchen cabinet. Meanwhile, Sarah walked into the living room. Kevin then moved to the microwave and asked, \"Any idea where the milk is?\" Sarah, while walking towards a mug, replied, \"I found the milk inside the microwave in the kitchen.\" Kevin opened the microwave, grabbed the milk, and closed the microwave. Sarah grabbed the mug and walked towards the bedroom. Kevin then walked to the bedroom and placed the milk on the coffee table.",
    "4077": "Michael walked into the kitchen, then moved to the living room, and returned to the kitchen. Meanwhile, Mary walked to a cabinet, opened it, and grabbed a remote control. Michael asked, \"Any idea where the beer is?\" as he walked to the microwave and opened it. Mary replied, \"I found the beer inside the microwave in the kitchen,\" while closing the cabinet and walking to the coffee table. Michael closed the microwave and walked to the fridge. Mary placed the remote control on the coffee table. Michael opened the fridge, grabbed a beer, and closed the fridge.",
    "4078": "Michael and Mary both walked into the kitchen. Michael then moved towards the stove while Mary headed to the wineglass. \"Any idea where the potato is?\" Michael asked as he walked towards the bathroom. \"I found a potato inside the bathroom cabinet,\" Mary replied while grabbing a wineglass. Michael walked to the bathroom cabinet, opened it, and then closed it after checking. Meanwhile, Mary walked to the living room and placed the wineglass on the coffee table. Michael returned to the kitchen, walked to a kitchen cabinet, opened it, grabbed the potato, and then closed the cabinet.",
    "4081": "Michael walked into the kitchen and headed to a kitchen cabinet. Meanwhile, Sarah walked to the stove. Michael opened the kitchen cabinet and asked, \"Any idea where my cellphone might be?\" Sarah replied, \"I found the cellphone inside the kitchen cabinet,\" while opening the stove. Michael closed the kitchen cabinet and walked to the living room. Sarah closed the stove and walked to the same kitchen cabinet Michael had checked. Michael walked to a cabinet in the living room, opened it, and grabbed his cellphone. He then closed the cabinet. Sarah opened the kitchen cabinet, grabbed a potato, closed the cabinet, and placed the potato on the kitchen counter.",
    "4083": "Michael walked to a kitchen cabinet while Mary entered the kitchen. Michael asked, \"Do you know where the mug is?\" as Mary walked to the stove. Mary replied, \"I found a mug inside the kitchen cabinet,\" while opening the stove. Michael opened and then closed a kitchen cabinet, while Mary grabbed the bread from the stove and closed it. Michael then walked to the living room, approached the mug, and grabbed it.",
    "4098": "Michael walked from the bathroom to the kitchen, while Mary also walked into the kitchen and headed to the fridge. Michael asked, \"Any idea where the remote control might be?\" as Mary opened the fridge and grabbed a bottle of wine. \"I found the remote control inside the kitchen cabinet,\" Mary replied, closing the fridge and walking to a kitchen cabinet.\n\nMichael walked to the kitchen cabinet and opened it, but then closed it and walked to the living room. Meanwhile, Mary walked to the kitchen cabinet, opened it, and put the wine inside before closing it. Michael continued to the cabinet in the living room, opened it, grabbed the remote control, and then closed the cabinet.",
    "4103": "Michael walked into the kitchen and headed to a kitchen cabinet. He opened and closed the microwave, then moved to another kitchen cabinet, opening and closing it as well. Meanwhile, Mary walked into the living room and approached a mug. She grabbed the mug and walked to the kitchen. Michael asked, \"Do you know where the toy is?\" as he walked towards the bedroom. Mary replied, \"I found a toy inside the kitchen cabinet,\" while placing the mug on the kitchen counter. Michael then grabbed the toy from the bedroom.",
    "4105": "John walked to the microwave and opened it, while Jessica walked into the kitchen. John closed the microwave and asked, \"Have you seen the remote control around?\" Jessica replied, \"I found the remote control inside the stove in the kitchen,\" while walking to the living room. John then walked to the stove, opened it, and closed it again, not finding the remote control there. \n\nJohn then walked to the living room and headed to a cabinet, while Jessica also walked to the living room and approached the same cabinet. John opened the cabinet and grabbed the remote control, while Jessica opened the cabinet and grabbed a beer. John closed the cabinet and walked to the sofa, while Jessica stayed in the living room.",
    "4106": "John walked to the microwave, while Mary headed to the kitchen. As John moved to the living room, he asked, \"Do you know where the spoon is?\" Mary replied, \"I found a spoon inside the cabinet in the living room,\" while walking to the stove. John then walked to the cabinet in the living room, opened it, and then closed it, while Mary opened the stove and grabbed a carrot from inside. John walked to the bedroom and grabbed the spoon, while Mary closed the stove.",
    "4124": "Michael walked to the microwave and opened it, while Jessica walked into the kitchen. Michael closed the microwave and asked, \"Have you seen the spoon around?\" Jessica replied, \"I found a spoon inside the kitchen cabinet,\" as she walked to the microwave. Michael then walked to a kitchen cabinet, opened it, and grabbed the spoon. Meanwhile, Jessica opened the microwave, grabbed the milk, and closed the microwave. Michael closed the kitchen cabinet.",
    "4145": "Kevin walked into the kitchen and then moved towards a kitchen cabinet. Meanwhile, Mary walked into the bedroom and grabbed a beer. As Kevin paused, he asked, \"Any idea where the potato is?\" Mary, now heading to the kitchen, replied, \"I found a potato inside the kitchen cabinet.\" Kevin opened the kitchen cabinet, then closed it and moved to the stove. Mary walked to the kitchen counter and placed the beer on it. Kevin opened the stove, grabbed the potato, and then closed the stove.",
    "4150": "John walked into the kitchen and headed towards the fridge, while Jessica walked from the bedroom and grabbed a milk. As John moved to a kitchen cabinet, he asked, \"Have you seen the spoon around?\" Jessica, now walking towards the kitchen, replied, \"I found a spoon inside the kitchen cabinet.\" John opened the kitchen cabinet, grabbed the spoon, and closed the cabinet. Meanwhile, Jessica walked to the fridge, opened it, and placed the milk inside.",
    "4162": "Michael walked into the kitchen and headed to a kitchen cabinet. He opened and then closed the cabinet, finding nothing of interest. He then walked to the fridge and opened it. Meanwhile, Emma walked into the living room and moved towards a cabinet. She opened the cabinet, grabbed a bread, and closed the cabinet. \n\nMichael walked to the stove and opened it, asking, \"Do you know where the carrot is?\" Emma, now in the kitchen, replied, \"I found a carrot inside the stove in the kitchen.\" Michael grabbed the carrot from the stove. Emma walked to the fridge, opened it, put the bread inside, and closed the fridge.",
    "4172": "Kevin walked from the bathroom to the kitchen, while Jessica also walked into the kitchen. Kevin then moved to a kitchen cabinet, and Jessica walked to another kitchen cabinet. As Kevin walked to the living room, he asked, \"Any idea where the wine might be?\" Jessica replied, \"I found the wine inside the cabinet in the living room,\" while opening the kitchen cabinet and grabbing the bread. \n\nKevin continued to the cabinet in the living room, opened it, and grabbed the wine. Meanwhile, Jessica closed the kitchen cabinet, opened the fridge, and put the bread inside. She then closed the fridge. Kevin closed the cabinet in the living room and walked back to the kitchen, where he placed the wine on the kitchen table.",
    "4184": "John walked into the kitchen while Jessica headed to the living room. John then walked back to the living room and asked, \"Do you know where the juice is?\" Jessica, who was walking towards a cabinet, replied, \"I found the juice on the kitchen table.\" John returned to the kitchen and walked to a kitchen cabinet. Meanwhile, Jessica grabbed a folder from the cabinet and walked to the coffee table. John opened the kitchen cabinet, grabbed the juice, and closed the cabinet. Jessica placed the folder on the coffee table.",
    "4190": "John walked from the bathroom to the kitchen, while Jessica also walked into the kitchen. John then moved to a kitchen cabinet and opened it, asking, \"Do you know where the beer is?\" Jessica responded, \"I found the beer inside the kitchen cabinet,\" while she walked to another kitchen cabinet, opened it, and grabbed a juice. John closed the kitchen cabinet and walked to the living room, heading towards a cabinet. Jessica closed the kitchen cabinet and walked to the fridge. John opened the cabinet and grabbed the beer, while Jessica opened the fridge and put the juice inside. John closed the cabinet, and Jessica closed the fridge.",
    "4198": "Michael walked to the microwave and opened it, while Mary walked into the kitchen. Michael closed the microwave and asked, \"Do you know where the bread is?\" Mary replied, \"I found the bread inside the cabinet in the living room,\" as she walked to the fridge. Michael then walked to the living room and approached the cabinet. Meanwhile, Mary opened the fridge, grabbed the wine, and closed the fridge.\n\nMichael opened and closed the cabinet in the living room, then walked back to the kitchen. Mary walked to the microwave, opened it, and put the wine inside before closing it. Michael walked to a kitchen cabinet, opened it, grabbed the bread, and closed the cabinet.",
    "4200": "Michael walked into the kitchen while Jessica headed to the living room. Michael then walked to the living room as Jessica remained silent. Returning to the kitchen, Michael asked, \"Do you know where the juice is?\" Jessica, now in the bedroom, replied, \"I found the juice inside the kitchen cabinet.\" Michael walked to a kitchen cabinet, opened it, and then closed it after not finding the juice. Meanwhile, Jessica walked to a mug, grabbed it, and moved back to the living room. Michael walked to the fridge, opened it, and grabbed the juice. He then closed the fridge as Jessica placed the mug on the coffee table.",
    "4284": "Michael walked into the kitchen and headed to a kitchen cabinet. Meanwhile, Jessica walked into the living room and approached a magazine. Michael opened the kitchen cabinet, then closed it, and asked, \"Do you know where the carrot is?\" Jessica, grabbing the magazine, replied, \"I found a carrot inside the stove in the kitchen.\"\n\nFollowing Jessica's information, Michael walked to the stove, opened it, and grabbed the carrot. He then closed the stove. Meanwhile, Jessica walked to the kitchen, then to the bedroom, and finally to a desk where she put the magazine back.\n\nMichael found the carrot in the stove and Jessica placed the magazine on the desk.",
    "4324": "Mary walked into the kitchen and headed towards the stove, while John remained silent. Mary then moved to a kitchen cabinet and opened it, asking, \"Do you know where the milk is?\" John, who had just walked into the kitchen, replied, \"I found the milk inside the kitchen cabinet.\" Mary grabbed the milk from the cabinet, closed it, and walked to the bedroom. Meanwhile, John walked to another kitchen cabinet, opened it, grabbed a juice, and closed the cabinet. Mary placed the milk on the coffee table in the bedroom.\n\nJohn then walked to the fridge, opened it, and put the juice inside. Mary remained in the bedroom, having completed her task.",
    "4327": "John and Jessica both walked into the kitchen. John asked, \"Do you happen to know where the carrot is?\" as he walked towards the stove. Jessica responded, \"I found a carrot inside the stove in the kitchen,\" while heading to the fridge. John opened the stove, grabbed the carrot, and closed the stove. Meanwhile, Jessica opened the fridge, grabbed a beer, and closed the fridge. John then walked to the kitchen table and placed the carrot on it.",
    "4331": "Jessica walked into the kitchen and headed towards a kitchen cabinet. Meanwhile, Kevin entered the kitchen. Jessica asked, \"Any idea where the potatoes are?\" as she walked to the stove. Kevin replied, \"I found a potato inside the stove in the kitchen,\" while walking towards the microwave. Jessica opened and then closed the stove, finding it empty. She then walked to another kitchen cabinet, opened it, and grabbed a potato. She closed the cabinet and paused.\n\nKevin opened and closed the microwave, then opened and closed the same kitchen cabinet Jessica had just checked. He walked to the stove, opened it, and grabbed a carrot. He then closed the stove.\n\nJessica, having found the potato, stood by the kitchen cabinet, while Kevin completed his task by placing the carrot on the counter.",
    "4338": "Michael walked into the kitchen and headed to a kitchen cabinet. He opened and then closed the cabinet. Meanwhile, Jessica walked from the bedroom and grabbed a spoon. She then walked to the kitchen and approached the same kitchen cabinet. Michael asked, \"Do you know where the carrot is?\" as Jessica opened the cabinet and put the spoon inside. Jessica replied, \"I found a carrot inside the stove in the kitchen.\" Michael then opened the stove, grabbed the carrot, and closed the stove.",
    "4343": "Michael walked into the kitchen and headed to a kitchen cabinet. Meanwhile, Sarah walked into the living room and grabbed a book. Michael opened and closed the kitchen cabinet, then moved to the stove, opening and closing it as well. Sarah walked into the kitchen and placed the book on the kitchen table. Michael opened another kitchen cabinet and closed it, then walked to the fridge. \"Any idea where the carrot is?\" he asked. \"I found a carrot inside the kitchen cabinet,\" Sarah replied. Michael opened the fridge, grabbed the carrot, and closed the fridge.",
    "4367": "Michael walked to the microwave and opened the fridge. Meanwhile, Jessica walked into the living room. Michael closed the fridge and asked, \"Have you seen my cellphone around?\" Jessica, grabbing a spoon, replied, \"I found a cellphone inside the cabinet in the living room.\" Michael then walked to the living room and headed to the cabinet. Jessica walked to the kitchen and then to the bedroom, placing the spoon on the coffee table. Michael opened the cabinet, grabbed his cellphone, and closed the cabinet.",
    "4369": "Michael and Jessica both walked into the kitchen. Michael asked, \"Any idea where the wine might be?\" as he walked towards a kitchen cabinet. Jessica replied, \"I found the wine inside the kitchen cabinet,\" while heading to another kitchen cabinet. Michael opened and then closed the kitchen cabinet, then walked to the fridge. Meanwhile, Jessica opened a kitchen cabinet, grabbed a potato, and closed the cabinet. \n\nMichael opened the fridge, grabbed the wine, and closed the fridge. Jessica opened the stove and put the potato inside.\n\nMichael and Jessica completed their tasks in the kitchen, each finding and placing their respective items.",
    "4370": "Michael walked to the microwave and opened it, then closed it again. Meanwhile, Jessica walked into the kitchen and headed to a kitchen cabinet. Michael asked, \"Do you know where the beer is?\" as Jessica opened the kitchen cabinet. \"I found a beer on the coffee table in the bedroom,\" Jessica replied, grabbing a potato from the cabinet. Michael walked to the bathroom and then to the bedroom, where he grabbed the beer. Jessica closed the kitchen cabinet and walked to the microwave, putting the potato inside and closing the microwave.",
    "4372": "Michael walked into the kitchen and headed to a kitchen cabinet. Meanwhile, Mary walked to the milk and grabbed it. Michael opened the microwave, closed it, and then asked, \"Do you know where the bread is?\" Mary replied, \"I found the bread inside the bathroom cabinet,\" while walking to the kitchen counter and placing the milk on it.\n\nMichael then walked to the bathroom, opened and closed the bathroom cabinet, and returned to the kitchen. He walked to the kitchen cabinet, opened it, grabbed the bread, and closed the cabinet.",
    "4374": "Kevin walked into the kitchen and headed towards the fridge, while Sarah walked into the bedroom and grabbed a spoon. As Kevin paused, he asked, \"Any idea where the bread is?\" Sarah, now walking towards the kitchen, replied, \"I found the bread inside the kitchen cabinet.\" Kevin then walked to the kitchen cabinet, opened it, and grabbed the bread. Meanwhile, Sarah walked to the kitchen counter and placed the spoon on it. Kevin closed the kitchen cabinet, completing his task.",
    "4385": "Michael walked to the microwave. As he stood there, he asked, \"Do you know where the carrot is?\" Mary, who was walking into the kitchen, replied, \"I found a carrot inside the microwave in the kitchen.\" Michael opened the microwave, checked inside, and then closed it. He then walked to the stove, opened it, and grabbed the carrot from inside before closing the stove.\n\nMeanwhile, Mary walked from the kitchen to the living room, then to a cabinet. She opened the cabinet, grabbed a cellphone, and closed the cabinet. She then walked to the sofa and placed the cellphone on it.",
    "4416": "John walked into the kitchen and moved towards the stove, then headed to the dishwasher. Meanwhile, Mary walked into the living room and approached the magazine. John paused and asked, \"Do you know where the spoon is?\" Mary, grabbing the magazine, replied, \"I found a spoon inside the microwave in the kitchen.\" John then opened and closed the microwave, walked to a kitchen cabinet, opened it, grabbed the spoon, and closed the cabinet. Mary walked back to the kitchen with the magazine.",
    "4419": "Michael walked to a kitchen cabinet while Sarah entered the kitchen. Michael asked, \"Do you know where the potato is?\" as Sarah walked to another kitchen cabinet. Sarah replied, \"I found a potato inside the kitchen cabinet\" while opening the cabinet. Michael then opened a different kitchen cabinet and closed it after not finding the potato. Sarah grabbed a bottle of wine from her cabinet and closed it.\n\nMichael walked to the stove, opened it, and found the potato inside. He grabbed the potato and closed the stove. Meanwhile, Sarah had already completed her task with the wine.",
    "4423": "Michael opened and then closed the microwave. Mary walked into the kitchen and moved towards the stove. Michael opened a kitchen cabinet and then closed it, asking, \"Do you know where the mug is?\" Mary replied, \"I found a mug on the coffee table in the bedroom,\" while opening the stove. Michael walked to the living room and then to the bedroom, while Mary grabbed the bread from the stove and closed it. Michael grabbed the mug from the coffee table in the bedroom and walked back to the kitchen. Mary put the bread on the kitchen counter. Michael placed the mug on the kitchen table.",
    "4429": "John opened the microwave and then closed it. Meanwhile, Emma walked into the kitchen. John asked, \"Do you happen to know where the juice is?\" as he walked to the fridge. Emma replied, \"I found the juice inside the fridge in the kitchen,\" while grabbing a toy. John opened the fridge, grabbed the juice, and then closed the fridge. Emma walked to the living room and put the toy back on the sofa.",
    "4439": "John and Jessica both walked into the kitchen. John then walked to a kitchen cabinet while Jessica walked to another kitchen cabinet and opened it. \"Any idea where the wine might be?\" John asked. \"I noticed a wine bottle on the coffee table in the living room,\" Jessica replied as she grabbed a juice from the cabinet and closed it. John then walked to the living room, found the wine on the coffee table, and grabbed it.",
    "4441": "Michael walked into the kitchen and headed towards a kitchen cabinet, while Mary walked to the fridge. Michael then moved to the fridge and asked, \"Do you know where the toy is?\" Mary replied, \"I found a toy inside the fridge in the kitchen,\" as she opened the fridge and grabbed a juice. Michael opened the fridge, found nothing, and closed it. He then walked to the living room, while Mary closed the fridge and walked to a kitchen cabinet.\n\nMichael found the toy in the living room, grabbed it, and returned to the kitchen. Meanwhile, Mary opened the kitchen cabinet and put the juice inside, closing the cabinet afterward. Michael walked to the kitchen counter and placed the toy on it.",
    "4449": "Michael walked into the kitchen and headed towards a kitchen cabinet. Meanwhile, Mary walked to the remote control and grabbed it. Michael paused and asked, \"Do you know where the folder is?\" Mary replied, \"I found a folder inside a kitchen cabinet,\" as she walked towards the kitchen. Michael opened a kitchen cabinet, then closed it and walked to the bedroom. Mary continued to the living room and placed the remote control on the coffee table. Michael grabbed the folder from the bedroom.",
    "4452": "Michael walked into the kitchen, while Mary grabbed the milk. As Michael moved towards a kitchen cabinet, he asked, \"Have you seen the toy around?\" Mary replied, \"I found a toy on the sofa in the living room,\" while walking to the bathroom. Michael then walked to the bedroom, while Mary headed to the living room. Michael continued to the living room and found the toy. He grabbed it and walked to the bathroom, while Mary walked to the bedroom and placed the milk on the coffee table. Michael then placed the toy on the bathroom counter.",
    "4453": "Michael walked to a kitchen cabinet, opened it, and then closed it. He moved to another kitchen cabinet and then headed to the living room. Meanwhile, Jessica walked into the living room and then to the kitchen. Michael asked, \"Any idea where the magazine is?\" as he continued his search. Jessica replied, \"I noticed a magazine on the coffee table in the living room,\" while grabbing the milk from the kitchen. Michael found the magazine in the living room, grabbed it, and walked to the bedroom. Jessica placed the milk on the kitchen counter. Michael then walked to the desk in the bedroom and put the magazine on it.",
    "4469": "Michael walked to a kitchen cabinet, opened it, and then closed it. He moved to another kitchen cabinet, opened it, and closed it again. Meanwhile, Mary walked into the living room and then into the kitchen. Michael asked, \"Do you happen to know where my cellphone is?\" as Mary grabbed a carrot. Mary replied, \"I found a cellphone inside the cabinet in the bedroom.\"\n\nMichael walked to the bedroom, then to a cabinet, opened it, and grabbed his cellphone before closing the cabinet. At the same time, Mary walked to the stove, opened it, put the carrot inside, and closed the stove.",
    "4473": "Michael walked into the kitchen and headed to a kitchen cabinet. Meanwhile, Mary walked to another kitchen cabinet. Michael opened the kitchen cabinet and asked, \"Have you seen the book anywhere?\" Mary replied, \"I found a book inside the kitchen cabinet,\" while opening her own cabinet. Michael closed his cabinet and walked to the living room. Mary grabbed a potato from her cabinet and closed it. Michael then grabbed the book from the living room.",
    "4482": "Michael walked into the kitchen and headed to a kitchen cabinet. Meanwhile, Sarah walked into the bedroom and grabbed a beer. Michael opened the dishwasher, closed it, and then opened the kitchen cabinet, closing it again. Sarah walked into the kitchen and moved towards the fridge. Michael asked, \"Any idea where the bread is?\" as he walked to the fridge. Sarah replied, \"I found the bread inside the kitchen cabinet,\" while opening the fridge and putting the beer inside. Michael opened the fridge, grabbed the bread, and closed the fridge. Sarah then closed the fridge.",
    "4485": "Michael and Jessica both walked into the kitchen. Michael asked, \"Any idea where the potato is?\" as he walked to the fridge. Jessica replied, \"I found a potato inside the kitchen cabinet,\" while heading to a different kitchen cabinet. Michael then walked to a kitchen cabinet, opened it, and closed it again. Meanwhile, Jessica opened her kitchen cabinet, grabbed a juice, and closed the cabinet. Michael walked to the stove, opened it, grabbed the potato, and then closed the stove.",
    "4487": "John walked into the kitchen and headed to a kitchen cabinet, while Jessica walked into the living room and then to the kitchen. John asked, \"Any idea where the carrot is?\" as he moved towards the fridge. Jessica replied, \"I found a carrot inside the fridge in the kitchen,\" while walking towards the bedroom. John opened the fridge, checked inside, and then closed it. He then walked to the stove, opened it, and grabbed the carrot from inside before closing the stove.\n\nMeanwhile, Jessica walked to a cabinet in the bedroom, opened it, and grabbed a folder from inside before closing the cabinet.",
    "4488": "Michael and Jessica both walked into the kitchen. While Michael walked to a kitchen cabinet, he asked, \"Do you know where the remote control is?\" Jessica responded, \"I found the remote control inside the kitchen cabinet in the kitchen,\" as she grabbed a book from the kitchen. Michael continued to another kitchen cabinet, opened it, and then closed it. Meanwhile, Jessica walked to the living room and placed the book on the coffee table. Michael then walked to the bedroom, found the remote control, and grabbed it.",
    "4490": "John walked into the kitchen and headed to the dishwasher. He opened and then closed the dishwasher, then opened and closed a kitchen cabinet. Meanwhile, Jessica walked from the bedroom and grabbed a mug. She walked to the kitchen and placed the mug on the kitchen table. \n\nJohn asked, \"Any idea where the beer might be?\" Jessica replied, \"I found the beer inside the kitchen cabinet.\" John then walked to the living room and grabbed the beer.",
    "4499": "Michael and Jessica both walked into the kitchen. While Michael walked towards a kitchen cabinet, he asked, \"Do you know where the milk is?\" Jessica replied, \"I found the milk inside the kitchen cabinet,\" as she walked towards the bedroom. Michael continued to another kitchen cabinet, opened it, and then closed it after not finding the milk. Meanwhile, Jessica walked to a folder in the bedroom, grabbed it, and put it back on the coffee table.\n\nMichael then walked to the fridge, opened it, and grabbed the milk. He closed the fridge, completing his task.",
    "4505": "Kevin walked to a kitchen cabinet, opened it, and then closed it. Meanwhile, Mary walked to a mug, grabbed it, and headed to the kitchen. Kevin asked, \"Do you know where the wineglass is?\" as Mary walked to the living room. \"I found a wineglass on the coffee table in the bedroom,\" Mary replied while putting the mug on the coffee table. Kevin then walked to the bedroom and grabbed the wineglass.",
    "4506": "Michael walked to a kitchen cabinet and opened it, while Mary walked into the kitchen. Michael closed the kitchen cabinet and asked, \"Do you know where the book is?\" Mary replied, \"I found a book on the sofa in the bedroom,\" as she walked to another kitchen cabinet. Michael then walked to the bedroom and towards the book, while Mary opened the kitchen cabinet and grabbed a wineglass from it. Michael grabbed the book and walked to the bathroom, while Mary closed the kitchen cabinet and walked to the bedroom. Michael then walked to the living room and placed the book on the coffee table, while Mary walked to a cabinet, opened it, and placed the wineglass inside.",
    "4510": "John walked to a kitchen cabinet and opened it. Meanwhile, Jessica walked into the kitchen and headed to the fridge. John closed the kitchen cabinet and asked, \"Do you know where the bread is?\" Jessica replied, \"I found the bread inside the cabinet in the bedroom,\" while opening the fridge. \n\nJohn then walked to the bedroom and approached a cabinet. Jessica grabbed a beer from the fridge, closed it, and walked to the bedroom. John opened the cabinet, grabbed the bread, and closed the cabinet. Jessica placed the beer on the coffee table.\n",
    "4512": "John walked to a kitchen cabinet and opened it while Jessica walked into the kitchen. \"Do you know where the book is?\" John asked as he closed the kitchen cabinet. \"I found a book on the coffee table in the bedroom,\" Jessica replied while walking to another kitchen cabinet. John then walked to the bedroom and grabbed the book from the coffee table. Meanwhile, Jessica opened the kitchen cabinet, grabbed a potato, and closed the cabinet.",
    "4520": "Kevin walked to the microwave and opened it, while Jessica walked into the kitchen. Kevin closed the microwave and asked, \"Any idea where the wine might be?\" Jessica, walking to a kitchen cabinet, replied, \"I found the wine inside the kitchen cabinet.\" Kevin then walked to the kitchen cabinet, opened it, and grabbed the wine. Meanwhile, Jessica opened another kitchen cabinet, grabbed the milk, and closed the cabinet. Kevin closed the kitchen cabinet after retrieving the wine.",
    "4525": "John opened and closed the microwave, then walked to a kitchen cabinet. Meanwhile, Jessica walked into the bedroom. John opened and closed the kitchen cabinet, then opened and closed the stove. As Jessica walked into the kitchen, John asked, \"Any idea where the carrot is?\" Jessica replied, \"I found a carrot inside the stove in the kitchen,\" while grabbing a book. John walked to the fridge, opened it, grabbed the carrot, and closed the fridge. Jessica walked to the living room and placed the book on the sofa. John walked to the dishwasher and put the carrot on the kitchen counter.",
    "4540": "Michael walked to the dishwasher, opened it, and then closed it. Meanwhile, Mary walked into the bedroom and grabbed a folder. Michael then walked to a kitchen cabinet, opened it, and closed it again. As Mary walked to the kitchen, Michael asked, \"Any idea where the carrot is?\" Mary replied, \"I found a carrot inside the kitchen cabinet,\" while putting the folder back on the kitchen table. Michael then walked to the stove, opened it, grabbed the carrot, and closed the stove.",
    "4542": "John walked into the kitchen while Mary headed to a kitchen cabinet. \"Any idea where the potato is?\" John asked as he walked to another kitchen cabinet. \"I found a potato inside the stove in the kitchen,\" Mary replied while opening the kitchen cabinet. John then walked to the stove, opened it, and grabbed the potato. Meanwhile, Mary grabbed a bread from the kitchen cabinet and closed it. John closed the stove and opened a kitchen cabinet, placing the potato inside before closing it. Mary opened the microwave, put the bread inside, and closed it.",
    "4546": "Michael walked to a kitchen cabinet and opened it, while Jessica entered the kitchen. \"Any idea where the milk is?\" Michael asked, closing the cabinet. \"I found the milk inside the microwave in the kitchen,\" Jessica replied as she walked to the same kitchen cabinet. Michael then walked to the microwave, opened it, and grabbed the milk. Meanwhile, Jessica opened the kitchen cabinet, grabbed a potato, and closed the cabinet. Michael closed the microwave, completing his task.",
    "4552": "Michael walked to a kitchen cabinet and opened it, while Sarah walked into the kitchen. Michael asked, \"Do you happen to know where my cellphone is?\" as he closed the kitchen cabinet. Sarah replied, \"I found a cellphone inside the cabinet in the bedroom,\" while walking to another kitchen cabinet. Michael then walked to the bedroom and headed to a cabinet, while Sarah opened the kitchen cabinet and grabbed a spoon from it. \n\nMichael opened the cabinet in the bedroom and grabbed his cellphone, then closed the cabinet. Meanwhile, Sarah closed the kitchen cabinet and walked to the living room, eventually making her way to the bedroom.",
    "4556": "Michael walked into the kitchen and headed to the fridge. Meanwhile, Jessica walked from the bedroom and grabbed a mug. Michael opened the fridge, then closed it, asking, \"Do you know where the juice is?\" Jessica, now in the kitchen, replied, \"I found the juice inside the kitchen cabinet,\" as she walked to the kitchen counter and placed the mug on it. Michael walked to the kitchen cabinet, opened it, grabbed the juice, and then closed the cabinet.",
    "4559": "David walked into the kitchen and headed to a kitchen cabinet. While opening the cabinet, he asked, \"Any idea where the remote control might be?\" Emma, who was also in the kitchen, responded, \"I found the remote control inside the kitchen cabinet,\" while opening another kitchen cabinet and grabbing a potato. David closed the cabinet and walked to the bedroom, while Emma closed her cabinet. David then walked to the remote control, grabbed it, and completed his task.",
    "4567": "John walked into the kitchen and headed to the fridge. He opened and then closed the fridge, finding nothing. Meanwhile, Jessica walked into the living room and then into the kitchen. John asked, \"Any idea where the potatoes are?\" as he walked to the bathroom. Jessica replied, \"I found a potato inside the bathroom cabinet,\" while heading back to the living room.\n\nJohn opened the bathroom cabinet but found nothing. He returned to the kitchen and walked to a kitchen cabinet. He opened it, grabbed a potato, and then closed the cabinet. Meanwhile, Jessica walked to a folder in the living room, grabbed it, and carried it to the bedroom. She opened a cabinet, put the folder inside, and then closed the cabinet.",
    "4568": "Michael walked into the kitchen and then moved towards a kitchen cabinet, while Jessica walked to the stove. Michael asked, \"Do you know where the book is?\" as Jessica opened the stove and replied, \"I found a book inside the cabinet in the bedroom.\" Michael then walked to the bedroom, while Jessica grabbed a potato from the stove and closed it. Michael headed to a cabinet, opened it, and grabbed the book. Meanwhile, Jessica walked to the kitchen counter and placed the potato on it. Michael closed the cabinet, walked to the living room, and put the book on the coffee table.",
    "4594": "Kevin and Mary both walked into the kitchen. Kevin opened a kitchen cabinet and asked, \"Do you know where the spoon is?\" Mary, while walking to the stove, replied, \"I found a spoon inside the kitchen cabinet.\" Kevin grabbed the spoon from the cabinet and closed it. Meanwhile, Mary opened the stove, grabbed a potato from inside, and then closed the stove.",
    "4604": "Michael walked into the kitchen and headed to a kitchen cabinet. \"Do you happen to know where the mug is?\" he asked. Sarah, opening the fridge, replied, \"I found a mug on the coffee table in the bedroom.\" Michael then walked to the bathroom and then to the bedroom, where he grabbed the mug. Meanwhile, Sarah grabbed the milk from the fridge, closed it, and placed the milk on the kitchen table. Michael returned to the kitchen and placed the mug on the kitchen table as well.",
    "4606": "Kevin walked into the kitchen and moved towards a kitchen cabinet, while Sarah walked to another kitchen cabinet. Kevin then walked to the bedroom and asked, \"Do you know where the beer is?\" Sarah replied, \"I don't know where one of the beers is, but I did see a beer on the coffee table in the living room,\" while opening the kitchen cabinet and grabbing a juice. \n\nKevin then walked to the living room and grabbed the beer from the coffee table, while Sarah closed the kitchen cabinet and walked to the kitchen counter, placing the juice on it. Kevin returned to the kitchen, walked to the fridge, opened it, and put the beer inside. Finally, he closed the fridge.",
    "4618": "Kevin walked to a kitchen cabinet and opened it, while Emma walked into the kitchen. Kevin then closed the cabinet and asked, \"Do you know where the bread is?\" Emma replied, \"I found some bread inside the fridge in the kitchen,\" as she walked to the fridge. Kevin followed her advice and walked to the fridge, while Emma opened the fridge and grabbed a bottle of wine. Kevin grabbed the bread from the fridge and closed it, while Emma walked to the bedroom with the wine. Emma then walked to a cabinet, opened it, and placed the wine inside.",
    "4623": "Michael walked into the kitchen and headed to a kitchen cabinet. Meanwhile, Mary walked to a book and grabbed it. Michael asked, \"Do you know where the milk is?\" as he walked towards the bathroom. Mary replied, \"I found the milk inside the bathroom cabinet,\" while walking to a cabinet. Michael opened the bathroom cabinet, then walked back to the kitchen and headed to the microwave. Mary opened the cabinet and put the book inside, then closed it. Michael opened the microwave, grabbed the milk from inside, and closed the microwave.",
    "4641": "Michael walked into the kitchen and headed towards a kitchen cabinet. Meanwhile, Mary also walked to a kitchen cabinet. Michael asked, \"Do you know where the potato is?\" as Mary moved to another kitchen cabinet. Mary replied, \"I found a potato inside the dishwasher in the kitchen,\" while opening the cabinet and grabbing a wineglass from it. Michael then opened the dishwasher, checked inside, and closed it. Mary closed the kitchen cabinet and stopped her actions. Michael walked to the stove, opened it, grabbed the potato from inside, and then closed the stove.",
    "4656": "Michael walked into the kitchen and then moved to a kitchen cabinet. Meanwhile, Emma walked to a toy and grabbed it. Michael asked, \"Do you know where the spoon is?\" as he walked towards the living room. Emma replied, \"I found a spoon on the coffee table in the living room,\" while heading to the living room. Michael grabbed the spoon, and Emma put the toy back on the sofa.",
    "4658": "John walked into the kitchen and headed to a kitchen cabinet. He opened and then closed the cabinet, asking, \"Any idea where the book is?\" Meanwhile, Mary walked from the bedroom, grabbed a mug, and moved to the kitchen. She placed the mug on the kitchen counter and replied, \"I found a book on the sofa in the living room.\"\n\nJohn then walked to the living room, approached the book, and grabbed it.",
    "5010": "Michael walked into the kitchen and moved towards a kitchen cabinet. He opened and then closed the cabinet, before walking to another kitchen cabinet. Meanwhile, Sarah walked from the bedroom to a mug, grabbed it, and headed to the kitchen. Michael asked, \"Do you know where the spoon is?\" as Sarah walked to a kitchen cabinet. She replied, \"I found a spoon on the coffee table in the living room,\" while opening the cabinet and placing the mug inside. Michael then walked to the living room and grabbed the spoon. Sarah closed the kitchen cabinet.",
    "5017": "Michael walked to a kitchen cabinet and opened the stove, then closed it. Meanwhile, Jessica walked from the bedroom to a mug and grabbed it. Michael opened the dishwasher and asked, \"Do you know where the bread is?\" Jessica replied, \"I found the bread inside the dishwasher in the kitchen,\" while walking to the kitchen. Michael closed the dishwasher and walked to the fridge. Jessica walked to a kitchen cabinet, opened it, and put the mug inside, then closed the cabinet. Michael opened the fridge, grabbed the bread, and closed the fridge.",
    "5039": "Kevin walked into the kitchen and headed to the dishwasher. Sarah followed shortly after. While walking to a kitchen cabinet, Kevin asked, \"Do you know where the carrot is?\" Sarah replied, \"I found a carrot inside the kitchen cabinet,\" while walking to another kitchen cabinet. Kevin opened and closed a kitchen cabinet, then walked to the fridge. Meanwhile, Sarah opened a kitchen cabinet, grabbed a wineglass, and closed the cabinet. Kevin opened the fridge, grabbed a carrot, and closed the fridge. Sarah walked to the kitchen table and placed the wineglass on it.",
    "5042": "Michael walked into the kitchen and headed towards a kitchen cabinet. Meanwhile, Jessica walked to another kitchen cabinet. Michael asked, \"Do you know where the carrot is?\" as he opened the cabinet. Jessica replied, \"I found a carrot inside the kitchen cabinet,\" while opening her own cabinet and grabbing a spoon. \n\nMichael then walked to the fridge, opened it, and grabbed the carrot. Jessica closed the kitchen cabinet after taking the spoon. Michael closed the fridge, completing his task.",
    "5068": "Kevin walked into the kitchen and moved towards a kitchen cabinet. Meanwhile, Mary walked to a cabinet and opened it. Kevin continued to another kitchen cabinet and opened it, while Mary grabbed a bottle of wine from her cabinet. Kevin closed the kitchen cabinet and asked, \"Do you know where the wineglass is?\" Mary replied, \"I noticed a wineglass on the coffee table in the living room,\" as she closed her cabinet and walked to the kitchen. Kevin then walked to the living room and grabbed the wineglass from the coffee table.",
    "5080": "Kevin walked into the kitchen and headed to a kitchen cabinet. He opened the cabinet, then closed it and asked, \"Do you know where the beer is?\" Meanwhile, Sarah grabbed a spoon and walked into the kitchen. She replied, \"I don't know where one of the beers is, but I did see a beer on the coffee table in the living room,\" as she walked to the dishwasher.\n\nKevin walked to the bedroom and then to the living room, where he grabbed the beer from the coffee table. Sarah opened the dishwasher, put the spoon inside, and closed it.",
    "5084": "John walked to a kitchen cabinet, while Mary entered the kitchen. John asked, \"Do you know where the spoon is?\" as he walked to another kitchen cabinet. Mary replied, \"I found a spoon inside the microwave in the kitchen.\" John then opened the microwave, closed it, and walked to another kitchen cabinet. He opened the cabinet, grabbed a spoon from it, and then closed the cabinet.",
    "5091": "Michael walked to a kitchen cabinet and opened it, then closed it and walked to the stove. Meanwhile, Mary opened a cabinet, grabbed a bread, and closed the cabinet. Michael opened the stove and asked, \"Do you know where the potato is?\" Mary replied, \"I found a potato inside the stove in the kitchen.\" Michael closed the stove and walked to another kitchen cabinet. He opened it, grabbed the potato, and then closed the cabinet. Mary walked into the kitchen.",
    "5095": "Michael and Mary both walked into the kitchen. Michael moved towards a kitchen cabinet and asked, \"Have you seen my cellphone around?\" Mary replied, \"I found the cellphone inside the kitchen cabinet,\" while heading to another kitchen cabinet. Michael opened the kitchen cabinet and then walked to the living room. Meanwhile, Mary opened her kitchen cabinet and grabbed a spoon from it. Michael continued to the living room, found his cellphone, and grabbed it.",
    "5099": "Kevin walked into the kitchen and headed towards a kitchen cabinet, while Mary also walked to a kitchen cabinet. Kevin then moved to the stove and asked, \"Any idea where the potato is?\" Mary replied, \"I found a potato inside the stove in the kitchen,\" as she walked to another kitchen cabinet. Kevin opened the stove, grabbed the potato, and closed the stove. Meanwhile, Mary opened the kitchen cabinet, grabbed the bread, and closed the cabinet.\n\nKevin walked to the microwave, opened it, placed the potato inside, and closed the microwave. At the same time, Mary walked to the bedroom, approached a cabinet, opened it, placed the bread inside, and closed the cabinet.",
    "5103": "Kevin walked to a kitchen cabinet, while Emma walked into the bedroom. Kevin then moved to another kitchen cabinet, opened it, and closed it again. Meanwhile, Emma walked into the kitchen and grabbed a toy. Kevin walked to yet another kitchen cabinet and then headed to the living room. Emma walked to the kitchen table and put the toy on it. \n\n\"Any idea where the wine might be?\" Kevin asked as he continued his search. Emma replied, \"I found the wine on the coffee table in the living room.\" Kevin then grabbed the wine from the living room.",
    "5105": "Kevin walked into the kitchen while Mary headed to the fridge. Kevin asked, \"Do you know where the toy is?\" as Mary opened the fridge. Mary replied, \"I found a toy on the coffee table in the living room,\" while grabbing a beer from the fridge. Kevin then walked to the living room and grabbed the toy from the coffee table. Meanwhile, Mary closed the fridge. Kevin walked to the sofa and placed the toy on it.",
    "5121": "Michael walked into the kitchen and headed towards a kitchen cabinet. Meanwhile, Mary walked to the stove. As Michael moved to the microwave, he asked, \"Hey, do you know where the beer is?\" Mary replied, \"I found a beer inside the microwave in the kitchen,\" while opening a kitchen cabinet. Michael opened the microwave and then walked to the fridge. Mary grabbed a spoon from the kitchen cabinet and closed it. Michael opened the fridge, grabbed the beer, and then closed the fridge.",
    "5138": "John and Sarah both walked into the kitchen. John moved towards the kitchen cabinet and then to the stove, asking, \"Do you know where the bread is?\" Sarah, while walking to another kitchen cabinet, replied, \"I found the bread inside the stove in the kitchen.\" John opened the stove, grabbed the bread from inside, and then closed the stove. Meanwhile, Sarah opened the kitchen cabinet, grabbed a potato from it, and then closed the cabinet.",
    "5154": "Michael walked to a kitchen cabinet and opened the stove, then closed it. Meanwhile, Sarah walked to a cabinet, opened it, grabbed a wineglass, and closed the cabinet. Michael asked, \"Any idea where the wine might be?\" as Sarah walked to the kitchen and placed the wineglass on the kitchen table, replying, \"I found the wine inside the kitchen cabinet.\" Michael then walked to another kitchen cabinet, opened it, grabbed the wine, and closed the cabinet.",
    "5165": "John walked into the kitchen while Mary grabbed the milk. As John moved towards a kitchen cabinet, he asked, \"Do you happen to know where the book is?\" Mary replied, \"I found a book on the sofa in the living room,\" while walking to the kitchen table and placing the milk on it. John then walked to the bedroom, then to the living room, and finally to the book. He grabbed the book and returned to the kitchen, placing it on the kitchen table.",
    "5173": "Kevin and Mary both walked into the kitchen. Kevin moved towards a kitchen cabinet and then to the stove. \"Any idea where the potatoes are?\" he asked. Mary, heading to the fridge, replied, \"I found a potato inside the stove in the kitchen.\" Kevin opened and then closed the stove, not finding the potato there. He then walked to another kitchen cabinet, opened it, and grabbed a potato from inside. He closed the cabinet.\n\nMeanwhile, Mary opened the fridge, grabbed a carrot, and closed the fridge. She then walked to the microwave, carrying the carrot.",
    "5175": "Michael walked to a kitchen cabinet and opened it. Meanwhile, Jessica entered the kitchen. Michael closed the kitchen cabinet and asked, \"Any idea where the potato is?\" Jessica replied, \"I found a potato inside the bathroom cabinet,\" while walking towards the milk. Michael then walked to the bathroom and opened the bathroom cabinet, but found nothing and closed it. Jessica grabbed the milk and walked to the kitchen table, placing the milk on it. Michael returned to the kitchen, walked to the kitchen cabinet, opened it, and grabbed the potato. He then closed the kitchen cabinet.",
    "5197": "Michael walked into the kitchen and headed towards a kitchen cabinet. Meanwhile, Mary walked to the milk and grabbed it. Michael then moved to the microwave and asked, \"Any idea where the wine might be?\" Mary replied, \"I found the wine inside the microwave in the kitchen,\" as she walked to the kitchen cabinet. Michael opened the microwave, found it empty, and closed it. He then walked to the fridge, opened it, and grabbed the wine from inside, closing the fridge afterward. Mary, on the other hand, opened the kitchen cabinet, placed the milk inside, and closed the cabinet.",
    "5302": "Michael walked into the kitchen and then headed to the bedroom. While walking, he asked, \"Any idea where the magazine might be?\" Mary, meanwhile, walked to a kitchen cabinet. She replied, \"I found a magazine inside the cabinet in the bedroom,\" while opening the kitchen cabinet. Michael reached the cabinet in the bedroom, opened it, and then closed it. Mary grabbed the juice from the kitchen cabinet and closed it. Michael walked to the living room and approached the magazine. Mary opened another kitchen cabinet and put the juice inside, then closed it. Michael grabbed the magazine.\n",
    "5379": "Michael opened and closed the dishwasher. Jessica walked into the kitchen and headed to the fridge. Michael walked to a kitchen cabinet and asked, \"Do you know where the beer is?\" Jessica replied, \"I found the beer inside the microwave in the kitchen,\" while opening the fridge. Michael opened and closed the microwave, then walked to the fridge. Jessica grabbed the juice from the fridge and closed it. Michael opened the fridge, grabbed the beer, and closed it. Jessica walked to the kitchen counter and put the juice on it.",
    "5381": "Michael walked to a kitchen cabinet while Sarah entered the kitchen. Michael opened the stove and asked, \"Any idea where the spoon might be?\" Sarah replied, \"I found a spoon inside the microwave in the kitchen,\" while walking towards a mug. Michael closed the stove and walked to the microwave, opening and closing it. Meanwhile, Sarah grabbed a mug. Michael then walked to the living room, approached the spoon, and grabbed it.",
    "5509": "Kevin walked to a kitchen cabinet while Mary entered the kitchen. As Kevin moved to another kitchen cabinet, he asked, \"Have you seen my cellphone around?\" Mary replied, \"I found a cellphone inside the cabinet in the bedroom,\" while walking to a kitchen cabinet. Kevin then walked to the bedroom and approached a cabinet. Meanwhile, Mary opened the stove, grabbed a bread from it, and closed the stove. Kevin opened the cabinet in the bedroom, grabbed the cellphone, and closed the cabinet.",
    "4047": "Jessica walked to the microwave while Michael entered the kitchen. Jessica opened a kitchen cabinet and asked, \"Any idea where the potato is?\" Michael replied, \"I found a potato inside the kitchen cabinet,\" while walking to the stove. Jessica closed the kitchen cabinet and opened another one, while Michael opened the stove and grabbed a potato. Jessica closed the second kitchen cabinet and walked to the stove, just as Michael closed the stove and walked to the microwave. Jessica opened the stove and grabbed a potato, then closed the stove. Meanwhile, Michael opened the microwave, put the potato inside, and closed the microwave.\n\nJessica and Michael both found potatoes in the stove. Jessica continued her search in the kitchen cabinets, while Michael placed his potato in the microwave.",
    "4101": "Jessica walked into the kitchen and headed to a kitchen cabinet. Meanwhile, Michael entered the kitchen. Jessica asked, \"Do you know where the juice is?\" as she opened the kitchen cabinet. Michael replied, \"I found the juice inside the kitchen cabinet,\" while walking to another kitchen cabinet.\n\nJessica closed the kitchen cabinet and walked to the fridge. She opened the fridge, grabbed the juice, and then closed the fridge. At the same time, Michael opened a kitchen cabinet, grabbed a potato, and closed the cabinet. Jessica placed the juice on the kitchen counter.\n\nMichael walked to the stove, opened it, and put the potato inside. He then closed the stove. Jessica and Michael completed their tasks without further communication.",
    "4102": "Mary walked to the microwave, opened it, and then closed it. Meanwhile, Kevin walked into the kitchen. Mary then walked to the living room and approached a cabinet, asking, \"Any idea where the spoon might be?\" Kevin replied, \"I found a spoon inside the cabinet in the living room,\" while walking to the stove.\n\nMary opened and closed the cabinet in the living room, then walked back to the kitchen. Kevin opened the stove, grabbed a carrot from inside, and closed the stove. Mary walked to a kitchen cabinet, opened it, grabbed a spoon, and then closed the cabinet.\n\nMary checked the microwave and the living room cabinet before finding the spoon in the kitchen cabinet. Kevin retrieved the carrot from the stove and completed his task.",
    "4113": "Sarah walked into the kitchen and headed to a kitchen cabinet. Meanwhile, Michael entered the kitchen as well. Sarah opened the kitchen cabinet and asked, \"Do you know where the milk is?\" Michael replied, \"I found the milk inside the kitchen cabinet,\" while walking to another kitchen cabinet. Sarah closed the kitchen cabinet and walked to the microwave. Michael opened the stove and grabbed a carrot from it. Sarah opened the microwave, grabbed the milk from inside, and closed the microwave. Michael closed the stove.\n",
    "4117": "Mary walked into the kitchen and headed towards the stove. Meanwhile, Kevin entered the kitchen. Mary then walked to a kitchen cabinet and asked, \"Any idea where the magazine might be?\" Kevin replied, \"I found a magazine inside the kitchen cabinet,\" as he walked to the fridge. Mary opened and then closed the kitchen cabinet, finding nothing. Kevin opened the fridge, grabbed the bread, and closed the fridge.\n\nMary then walked to the bedroom and grabbed the magazine.",
    "4123": "Sarah walked into the kitchen and headed to a kitchen cabinet. At the same time, John walked into the bedroom and grabbed a toy. Sarah opened the kitchen cabinet and then the stove. \"Any idea where the potato is?\" she asked. John, now in the kitchen, replied, \"I found a potato inside the kitchen cabinet,\" while placing the toy on the kitchen table. Sarah grabbed the potato from the stove and closed it.",
    "4133": "Mary walked into the kitchen and then moved to a kitchen cabinet. Meanwhile, Michael walked into the kitchen. Mary then walked to the bathroom and approached the bathroom cabinet. She opened and closed the bathroom cabinet before heading back to the kitchen. Michael, now in the kitchen, walked to the fridge and then to a kitchen cabinet. Mary asked, \"Do you know where the spoon is?\" as she walked to another kitchen cabinet. Michael replied, \"I found a spoon inside the bathroom cabinet,\" while opening a different kitchen cabinet and grabbing a potato. Mary opened the kitchen cabinet, grabbed the spoon, and closed the cabinet. Michael closed his cabinet as well.",
    "4140": "Mary walked into the kitchen, while Michael followed shortly after. As Mary moved towards a kitchen cabinet, she asked, \"Do you know where the juice is?\" Michael replied, \"I found the juice inside the bathroom cabinet,\" while heading towards the kitchen cabinet.\n\nMary then walked to the bathroom and opened the bathroom cabinet, but found nothing. She closed it and returned to the kitchen, heading towards another kitchen cabinet. Meanwhile, Michael opened a kitchen cabinet, grabbed a bread, and closed the cabinet. He then walked to the fridge, opened it, and placed the bread inside before closing the fridge.\n\nMary opened the kitchen cabinet, found the juice, and grabbed it.",
    "4160": "Mary walked into the kitchen and then moved to the living room. Meanwhile, Michael walked into the bedroom and grabbed a spoon. Mary returned to the kitchen and then went back to the living room. She asked, \"Any idea where the remote control might be?\" as Michael walked into the kitchen. Michael replied, \"I found the remote control inside the cabinet in the living room,\" while heading to the kitchen counter to put the spoon down.\n\nMary walked to the cabinet in the living room, opened it, and grabbed the remote control. She then closed the cabinet and walked to the coffee table, where she placed the remote control.",
    "4173": "Jessica walked into the kitchen and then moved towards a kitchen cabinet. Meanwhile, John asked, \"Any idea where the magazine is?\" as he walked into the kitchen. Jessica continued to the living room and then to a cabinet. John responded, \"I found a magazine inside the cabinet in the living room,\" as he walked to the fridge. Jessica opened the cabinet, grabbed the magazine, and closed the cabinet. John opened the fridge, grabbed the bread, and closed the fridge.\n",
    "4176": "Mary walked into the kitchen and then moved to a kitchen cabinet. Meanwhile, John walked into the kitchen. Mary then walked to the bedroom and asked, \"Do you know where the remote control is?\" John replied, \"I found the remote control on the coffee table in the bedroom,\" while walking to the stove. Mary grabbed the remote control from the bedroom and walked to the living room. John opened the stove, grabbed a carrot, and closed the stove. Mary placed the remote control on the coffee table. John then walked to the fridge, opened it, and put the carrot inside.\n",
    "4178": "Mary walked into the kitchen, while Michael remained silent. Mary then moved to the fridge, and Michael walked into the kitchen. As Mary headed to the living room, she asked, \"Any idea where the folder might be?\" Michael replied, \"I found a folder on the coffee table in the living room,\" while walking to a kitchen cabinet. Mary continued to the bathroom, while Michael opened the kitchen cabinet, grabbed a bottle of wine, and closed the cabinet.\n\nMary returned to the living room and grabbed the folder from the coffee table. Meanwhile, Michael walked to the kitchen table and placed the wine on it. Mary then walked to the desk and put the folder back on it.",
    "4280": "Mary walked into the kitchen, while John stayed silent. Mary then asked, \"Do you know where the juice is?\" as John walked into the kitchen. John replied, \"I found the juice inside the bathroom cabinet,\" while Mary walked to the bathroom. Mary opened and closed the bathroom cabinet, finding nothing, and then walked back to the kitchen.\n\nMeanwhile, John walked to the fridge, opened it, grabbed a bottle of wine, and closed the fridge. He then walked to the living room and then to the bedroom, where he placed the wine on the coffee table.\n\nMary walked to a kitchen cabinet, opened it, grabbed the juice, and closed the cabinet.",
    "4285": "Jessica walked into the kitchen and then moved to the living room. She returned to the kitchen and then back to the living room. Meanwhile, John walked to a magazine and grabbed it. \n\n\"Have you seen my cellphone around?\" Jessica asked as she walked to a cabinet. \"I found a cellphone inside the cabinet in the living room,\" John replied. Jessica opened the cabinet, grabbed the cellphone, and closed the cabinet. \n\nJohn walked to the kitchen, then to the bathroom, and finally to the bedroom. He put the magazine back on the coffee table.",
    "4312": "Jessica walked into the kitchen and headed to a kitchen cabinet. Meanwhile, Michael entered the kitchen. Jessica asked, \"Do you know where the bread is?\" as she opened the fridge. Michael replied, \"I found the bread inside the fridge\" while walking towards the living room. Jessica closed the fridge and walked back to the kitchen cabinet. Michael continued to the living room, walked to a folder, and grabbed it. Jessica opened the kitchen cabinet, grabbed the bread, and closed the cabinet. Michael returned to the kitchen and placed the folder on the kitchen table.",
    "4328": "Mary walked into the kitchen and headed to a kitchen cabinet. Meanwhile, John entered the kitchen as well. Mary asked, \"Any idea where the potatoes are?\" while John walked to another kitchen cabinet. John replied, \"I found a potato inside the kitchen cabinet,\" as Mary opened and then closed her kitchen cabinet.\n\nMary then opened the stove and grabbed a potato from inside, closing the stove afterward. At the same time, John opened his kitchen cabinet, grabbed a juice, and then closed the cabinet. He placed the juice back on the kitchen counter.\n\nMary and John both completed their tasks in the kitchen, with Mary securing the potato and John placing the juice on the counter.",
    "4332": "Jessica walked into the kitchen and moved towards a kitchen cabinet. Meanwhile, Michael entered the kitchen. Jessica asked, \"Do you happen to know where the juice is?\" as she walked to another kitchen cabinet. Michael replied, \"I found the juice inside the kitchen cabinet,\" while heading towards the microwave.\n\nJessica opened the kitchen cabinet and grabbed the juice. At the same time, Michael opened the microwave and grabbed the milk. Jessica closed the kitchen cabinet and placed the juice on the kitchen counter. Michael closed the microwave and walked towards the bathroom.\n\nJessica stayed in the kitchen while Michael moved to the living room and then to the bedroom. Finally, Michael placed the milk on the coffee table in the bedroom.",
    "4365": "Jessica walked into the kitchen and then moved towards a kitchen cabinet. Meanwhile, Michael entered the kitchen and asked, \"Do you know where the milk is?\" Jessica responded, \"I found milk on the coffee table in the bedroom.\" Michael then walked to the kitchen cabinet, opened it, grabbed a bottle of wine, and closed the cabinet. Jessica walked to the bedroom and grabbed the milk from the coffee table.",
    "4415": "Mary walked into the kitchen and headed to a kitchen cabinet. Meanwhile, Michael entered the kitchen as well. Mary opened the kitchen cabinet and asked, \"Any idea where the potato is?\" Michael replied, \"I found a potato inside the kitchen cabinet,\" while walking to another kitchen cabinet. Mary closed the cabinet she had opened and walked to the stove. She opened the stove, grabbed a potato from inside, and closed the stove. Michael opened his kitchen cabinet, grabbed a bottle of wine, and closed the cabinet.\n\nMary then walked to the microwave, opened it, placed the potato inside, and closed the microwave.",
    "4458": "Mary walked to a kitchen cabinet and opened it, while Michael walked into the kitchen. Mary asked, \"Do you know where the beer is?\" as she closed the kitchen cabinet. Michael replied, \"I saw a beer on the coffee table in the living room,\" while grabbing a wine bottle from the kitchen. \n\nMary walked to the living room and grabbed the beer from the coffee table. Meanwhile, Michael walked to the kitchen cabinet, opened it, and placed the wine inside before closing the cabinet. \n\nMary then walked to the bedroom and put the beer back on the coffee table.",
    "4463": "Jessica walked into the kitchen and then moved to a kitchen cabinet. Meanwhile, Michael entered the kitchen. Jessica asked, \"Do you know where the juice is?\" as she walked towards the bathroom. Michael replied, \"I found the juice inside the bathroom cabinet,\" while heading to a kitchen cabinet. Jessica opened the bathroom cabinet, then returned to the kitchen and walked to another kitchen cabinet. Michael opened the microwave, grabbed the milk, and closed the microwave. Jessica opened the kitchen cabinet, grabbed the juice, and closed the cabinet. Michael walked to the fridge, opened it, and placed the milk inside.",
    "4526": "Jessica walked into the kitchen and moved towards a kitchen cabinet. Meanwhile, Kevin entered the kitchen. Jessica asked, \"Do you happen to know where the magazine is?\" Kevin replied, \"I found a magazine inside the kitchen cabinet in the kitchen,\" while walking towards the kitchen cabinet. Jessica continued to another kitchen cabinet, opened it, and then closed it. She then walked to the bedroom and grabbed a magazine. \n\nKevin grabbed a book from the kitchen and walked to the bedroom. Jessica walked to the living room and placed the magazine on the sofa. Kevin walked to the desk and placed the book on it.\n",
    "4527": "Mary walked into the kitchen while Michael headed to the fridge. Mary then asked, \"Do you know where the remote control is?\" as she walked to a kitchen cabinet. Michael replied, \"I found the remote control inside the stove in the kitchen,\" while grabbing a beer from the fridge and closing it. Mary then walked to the stove, checked it, and proceeded to the living room. She grabbed the remote control from the living room and walked to the bedroom. Finally, Mary walked to the sofa and placed the remote control on it.",
    "4529": "Mary walked into the kitchen and headed to a kitchen cabinet. Meanwhile, John entered the kitchen. Mary asked, \"Any idea where the carrot is?\" as she opened the kitchen cabinet. John replied, \"I found a carrot inside the kitchen cabinet in the kitchen,\" while walking to another kitchen cabinet.\n\nMary then walked to the stove and opened it, finding the carrot inside. She grabbed the carrot and closed the stove. At the same time, John walked to a kitchen cabinet, opened it, and then closed it. He then walked to the stove, opened it, and grabbed the bread.\n\nMary and John completed their tasks, with Mary securing the carrot and John retrieving the bread.",
    "4551": "Jessica walked into the kitchen and headed to a kitchen cabinet. As she opened the cabinet, she asked, \"Do you know where the juice is?\" Kevin, who was also in the kitchen, replied, \"I found the juice inside the kitchen cabinet in the kitchen,\" while walking towards the stove. Jessica closed the kitchen cabinet and walked to the fridge. Meanwhile, Kevin opened the stove, grabbed a carrot from inside, and closed the stove. Jessica opened the fridge, grabbed the juice, and then closed the fridge.",
    "4560": "Jessica walked into the kitchen and then moved to a kitchen cabinet. Meanwhile, Michael entered the kitchen. Jessica asked, \"Have you seen the remote control around?\" as she walked to the bedroom. Michael replied, \"I found the remote control on the coffee table in the bedroom,\" while grabbing a carrot from the kitchen.\n\nJessica found the remote control in the bedroom and walked to a cabinet. She opened the cabinet and placed the remote control inside, then closed the cabinet. Michael walked to the dishwasher, opened it, and then closed it. He then put the carrot back on the kitchen counter.\n\nJessica and Michael continued their tasks, with Jessica ensuring the remote control was securely stored in the cabinet and Michael organizing the kitchen counter.",
    "4576": "Mary walked into the kitchen and headed to a kitchen cabinet. Meanwhile, Kevin entered the kitchen as well. Mary opened the kitchen cabinet and asked, \"Do you know where the milk is?\" Kevin replied, \"I found the milk inside the kitchen cabinet,\" while walking to another kitchen cabinet. Mary grabbed the milk from the cabinet and closed it, then walked to the bathroom and then to the bedroom, where she placed the milk on the coffee table.\n\nKevin walked to a kitchen cabinet, opened it, and grabbed a wineglass. He then closed the cabinet and remained in the kitchen.",
    "4584": "Jessica walked into the kitchen and then moved towards a kitchen cabinet. Meanwhile, Michael entered the kitchen. Jessica asked, \"Do you know where the book is?\" as she walked towards the bedroom. Michael replied, \"I found a book inside the cabinet in the bedroom,\" while heading to the fridge. Jessica walked to the cabinet in the bedroom, opened it, and grabbed the book. She then closed the cabinet.\n\nMichael opened the fridge, grabbed a carrot, and closed the fridge. He then walked to the dishwasher, opened it, and closed it again.\n\nJessica, holding the book, returned to the kitchen. Michael, with the carrot in hand, continued his tasks in the kitchen.",
    "4621": "Mary walked into the kitchen and then to a kitchen cabinet. Meanwhile, Michael entered the kitchen. Mary then walked to the bedroom and asked, \"Any idea where the book might be?\" Michael replied, \"I found a book on the sofa in the bedroom,\" while walking to the stove. Mary walked to the book, grabbed it, and then headed to the living room. Michael opened the stove, grabbed the bread, and closed the stove. Mary placed the book on the sofa. Michael walked to the fridge, opened it, and put the bread inside.\n\nMary walked into the kitchen and then to a kitchen cabinet. Meanwhile, Michael entered the kitchen. Mary then walked to the bedroom and asked, \"Any idea where the book might be?\" Michael replied, \"I found a book on the sofa in the bedroom,\" while walking to the stove. Mary walked to the book, grabbed it, and then headed to the living room. Michael opened the stove, grabbed the bread, and closed the stove. Mary placed the book on the sofa. Michael walked to the fridge, opened it, and put the bread inside.",
    "4667": "Mary walked into the kitchen and headed to a kitchen cabinet, while John walked from the bedroom and grabbed the milk. As Mary paused, she asked, \"Any idea where the wine might be?\" John replied, \"I found the wine inside the kitchen cabinet,\" while walking into the kitchen.\n\nMary opened the kitchen cabinet, then closed it and walked to the fridge. She opened the fridge, grabbed the wine, and closed the fridge. Meanwhile, John continued to the kitchen. Mary walked to the kitchen table and placed the wine on it.",
    "5014": "Jessica walked into the kitchen, while John remained silent. Jessica then moved to the bedroom, asking, \"Any idea where the magazine might be?\" John, now in the kitchen, replied, \"I noticed a magazine on the coffee table in the living room.\" Jessica continued to the living room and grabbed the magazine from the coffee table.\n\nMeanwhile, John walked to the milk, grabbed it, and opened the microwave. He placed the milk inside the microwave and closed it. Jessica walked to the sofa and put the magazine back on it.",
    "5049": "Mary walked into the kitchen and then moved to a kitchen cabinet. Meanwhile, Michael stayed silent. Mary then walked to the living room and asked, \"Have you seen the book anywhere?\" Michael, who was still in the kitchen, replied, \"I found a book on the sofa in the living room.\" Mary continued to the book, grabbed it, and placed it back on the coffee table. \n\nMichael then walked into the kitchen, grabbed a folder, and moved to the living room. He placed the folder on the coffee table next to the book.",
    "5082": "Sarah walked into the kitchen and moved towards a kitchen cabinet, while Kevin walked from the bedroom to grab a mug. Sarah continued to another kitchen cabinet and opened it, then closed it without finding what she was looking for. Meanwhile, Kevin grabbed the mug and headed to the kitchen.\n\nSarah asked, \"Do you know where the beer is?\" as she walked to another kitchen cabinet. Kevin replied, \"I found the beer inside the kitchen cabinet,\" while opening a kitchen cabinet to put the mug inside and then closing it.\n\nSarah walked to the fridge, opened it, grabbed the beer, and closed the fridge. Kevin had already finished placing the mug inside the kitchen cabinet and closed it.",
    "5093": "Jessica walked into the kitchen, while Kevin followed shortly after. As Jessica moved towards a kitchen cabinet, she asked, \"Any idea where the remote control might be?\" Kevin replied, \"I found the remote control on the coffee table in the living room,\" while heading to another kitchen cabinet. Jessica then walked to the bedroom and then to the living room, while Kevin opened the kitchen cabinet, grabbed a spoon, and closed the cabinet.\n\nJessica found the remote control in the living room, grabbed it, and walked to the sofa. Meanwhile, Kevin walked to the living room and placed the spoon on the coffee table. Jessica then put the remote control back on the sofa.",
    "5098": "Mary walked into the kitchen and then to a kitchen cabinet, while John remained silent. Mary then walked to the bedroom and subsequently to the living room. She asked, \"Do you happen to know where the magazine is?\" as she continued her search. John, who had just walked into the kitchen, replied, \"I found a magazine on the coffee table in the living room.\"\n\nMary grabbed the magazine from the living room and walked to the sofa, placing it there. Meanwhile, John walked to the wineglass, grabbed it, and moved to the kitchen counter, where he placed the wineglass.\n\nMary and John completed their tasks, with Mary ensuring the magazine was on the sofa and John placing the wineglass on the kitchen counter.",
    "5123": "Sarah walked into the kitchen and moved towards a kitchen cabinet. Meanwhile, Michael entered the kitchen as well. Sarah then walked to the microwave and asked, \"Do you know where the bread is?\" Michael replied, \"I found the bread inside the microwave in the kitchen,\" while walking towards the milk. Sarah opened the microwave, checked inside, and then closed it. She then walked to another kitchen cabinet, opened it, and found the bread. She grabbed the bread and closed the cabinet.\n\nMichael grabbed the milk and walked to the kitchen table, placing the milk on it. Sarah continued her task, holding the bread.",
    "5126": "Jessica walked into the kitchen and headed to a kitchen cabinet. Meanwhile, Michael entered the kitchen. Jessica asked, \"Do you know where the bread is?\" as she walked to another kitchen cabinet. Michael replied, \"I found the bread inside the kitchen cabinet,\" while walking to a spoon. Jessica opened the kitchen cabinet, grabbed the bread, and closed the cabinet. She then opened the microwave, placed the bread inside, and closed the microwave. At the same time, Michael grabbed the spoon, walked to the kitchen table, and put the spoon back on the table.",
    "5127": "Mary walked into the kitchen and headed to a kitchen cabinet. As she opened the cabinet, she asked, \"Do you know where the beer is?\" John, who was also in the kitchen, responded, \"I found a beer inside the kitchen cabinet,\" while walking towards a spoon. Mary closed the cabinet and walked to the fridge. She opened the fridge, grabbed a beer, and then closed the fridge.\n\nMeanwhile, John grabbed the spoon and walked to the bedroom. He then moved to the living room and placed the spoon on the coffee table. Mary, having secured the beer, completed her task.",
    "4455": "John walked into the kitchen and moved towards a kitchen cabinet, while Jessica walked to another kitchen cabinet. John asked, \"Do you know where the bread is?\" Jessica replied, \"I found the bread inside the microwave in the kitchen,\" while opening the microwave and grabbing the milk from it. John then opened the microwave and closed it, while Jessica closed the microwave and walked to a kitchen cabinet. John proceeded to open the stove, grabbed the bread from inside, and then closed the stove.",
    "4375": "Mary walked into the kitchen, while Michael remained still. Mary asked, \"Any idea where the wine might be?\" as Michael walked into the kitchen. Michael replied, \"I found the wine inside the bathroom cabinet,\" while Mary walked to the living room. Mary then headed to the bathroom, opened and closed the bathroom cabinet, and walked back to the living room. Meanwhile, Michael walked to a kitchen cabinet, then to the living room, and finally to a cabinet. \n\nMary walked to the cabinet in the living room, opened it, and grabbed the wine. At the same time, Michael opened the cabinet, put the bread inside, and closed it. Mary then closed the cabinet, completing her task.",
    "4164": "Jessica walked to the microwave, opened it, and then closed it. Meanwhile, Michael walked into the living room and headed to a cabinet. Jessica then walked to the living room and back to the kitchen, asking, \"Do you know where the juice is?\" Michael, opening the cabinet, replied, \"I found the juice inside the kitchen cabinet,\" and grabbed a book from the cabinet. \n\nJessica walked to a kitchen cabinet, opened it, and grabbed the juice. She then closed the cabinet. Michael walked to the sofa and put the book on it.\n",
    "4224": "John walked from the bathroom to the kitchen, while Jessica also headed to the kitchen. John then moved to a kitchen cabinet and opened it, asking, \"Any idea where the spoon might be?\" Jessica, who was opening another kitchen cabinet, replied, \"I found a spoon inside the kitchen cabinet.\" John grabbed a spoon from the cabinet and closed it, then walked to the bedroom. Meanwhile, Jessica grabbed a spoon from her cabinet, closed it, and walked to the kitchen table. John placed the spoon on the desk in the bedroom, while Jessica placed her spoon on the kitchen table.",
    "4329": "John walked to the microwave and opened it, while Jessica walked into the kitchen. John closed the microwave and asked, \"Do you know where the beer is?\" Jessica replied, \"I found a beer on the coffee table in the bedroom,\" while walking to the stove. John then walked to the bedroom and grabbed the beer from the coffee table, while Jessica opened the stove, grabbed a carrot, and closed the stove.",
    "4575": "John walked into the kitchen and headed to a kitchen cabinet. As he opened the cabinet, he asked, \"Any idea where the magazine is?\" Jessica, who was also in the kitchen, replied, \"I found a magazine inside the kitchen cabinet,\" while walking to another kitchen cabinet. John closed the cabinet and walked to the bedroom, while Jessica opened a different cabinet, grabbed a spoon, and closed the cabinet. John then grabbed the magazine from the bedroom.",
    "5163": "Mary walked to the dishwasher, opened it, and then closed it. Meanwhile, Michael walked into the kitchen. Mary then walked to a kitchen cabinet, opened it, and closed it again. She asked, \"Any idea where my cellphone might be?\" as she walked to the living room. Michael responded, \"I found the cellphone inside the kitchen cabinet,\" while walking to another kitchen cabinet.\n\nMary continued to the living room and walked towards the cellphone. She grabbed the cellphone. Meanwhile, Michael opened the kitchen cabinet, grabbed a spoon, closed the cabinet, and walked to the kitchen table. He placed the spoon on the kitchen table.\n\nMary and Michael completed their tasks, with Mary securing her cellphone and Michael placing the spoon on the kitchen table.",
    "135": "Mark walked into the kitchen and moved towards a kitchen cabinet. He opened it, grabbed a spoon and then closed the cabinet. He placed the spoon on the kitchen table. Then he went to another kitchen cabinet, opened it, grabbed another spoon, and closed the cabinet. He also placed that spoon on the kitchen table. Afterward, he walked towards the bathroom. Later, Sarah walked into the kitchen, grabbed the spoon Mark previously placed on the kitchen table, and walked to the dishwasher. She opened the dishwasher and put the spoon inside.",
    "138": "David walked into the kitchen, grabbed a wineglass, and took it to the bedroom, placing it on a coffee table. He then walked into the bathroom. Later, Sarah went to the wineglass David had placed earlier, grabbed it, and walked to the kitchen. She moved to the dishwasher, opened it, and placed the wineglass inside.",
    "153": "Adam began by walking to a wineglass, grabbing a spoon and another wineglass. He walked into the bedroom, then the bathroom, and finally into the kitchen. He placed the wineglass and spoon on the kitchen table. Afterward, he went back to the bedroom, grabbed a mug, and moved it to the kitchen table. Meanwhile, Olivia walked into the kitchen, grabbed the mug Adam previously placed, walked to the dishwasher, opened it, and placed the mug inside.",
    "193": "David walked into the bedroom, approached a mug and grabbed it. He then walked to the kitchen and placed the mug on the kitchen table. After that, he walked to the bathroom. Emma later walked into the kitchen, grabbed the same mug from the kitchen table, and walked to the dishwasher. She opened the dishwasher, placed the mug inside, and then closed it.",
    "389": "Matthew walked to a wineglass and grabbed it. Then, he moved to the kitchen and to another wineglass, grabbing it. He went to the kitchen table and placed both wineglasses on it. He then walked to the bathroom where he stayed.\n\nSophia walked to a wineglass and moved to the kitchen. She grabbed the wineglass Matthew previously placed on the kitchen table. Moving to the living room, she placed the wineglass on the coffee table.",
    "532": "James walked into the kitchen, went to a wineglass, grabbed it, and then moved it to the kitchentable. He then opened a kitchen cabinet, grabbed a spoon from inside, closed the cabinet, and moved the spoon to the same kitchentable. After that, he walked to the bathroom. Later, Olivia walked into the kitchen, grabbed the spoon and the wineglass James previously placed on the kitchentable, then walked to the bedroom and livingroom. She placed the spoon and the wineglass on the coffee table in the living room.",
    "538": "Tom walked to a wineglass, grabbed it, and moved it to livingroom then placed it on coffeetable. He then walked into the kitchen, opened a kitchen cabinet, grabbed a spoon, closed the cabinet, and moved the spoon to livingroom where he placed it on coffeetable. Afterward, he walked into the bathroom. Later, Jane walked into the livingroom, grabbed the same spoon that Tom had previously placed, moved it to the bedroom, and put it on coffeetable.",
    "577": "Mark walked into the bedroom, grabbed a mug and a wineglass. He then walked to the living room where he placed the wineglass and mug on the coffee table. He proceeded to the kitchen, grabbed a spoon, and returned to the living room to place the spoon also on the coffee table. Afterward, Emma walked to the location where Mark previously placed the spoon. She grabbed it, walked to the kitchen, and placed it on the kitchen table. She then returned to the living room, grabbed the mug Mark previously placed, walked back to the kitchen, and placed the mug on the kitchen table. Mark then continued his activity by walking to the bathroom.",
    "628": "Mark walked into the kitchen and grabbed a wineglass and spoon. He then walked to the kitchen table and placed both items there. He proceeded to walk to the bedroom, grabbed a mug, and brought it back to place it on the kitchen table. After that, he walked to the bathroom. Later, Ellen walked to the wineglass and spoon Mark previously placed at the kitchen table, grabbed both and moved them to the coffee table in the living room. She then grabbed the mug Mark previously placed and moved it to the coffee table in the living room.",
    "630": "Tony walked to a wineglass, grabbed it, and moved it to the kitchen. He then placed the wineglass on the kitchen table and walked into the bathroom. Later, Sarah walked into the kitchen, grabbed the same wineglass that Tony had placed on the kitchen table, moved it to the living room, and placed it on the coffee table.",
    "642": "John began by walking to a cabinet, opening it, and grabbing a wineglass from inside. He then closed the cabinet, walked to the bedroom, then to the kitchen, where he put the wineglass on the kitchen table. He then walked to the bathroom.\n\nLater, Emma walked into the kitchen, grabbed the same wineglass that John had placed on the kitchen table, and walked to the bedroom and then to the living room, where she put the wineglass on the coffee table.",
    "647": "Ethan walked into the kitchen, headed straight to a kitchen cabinet, opened it, and grabbed a spoon. He closed the kitchen cabinet, walked to the kitchen table, and placed the spoon on it. He returned to the same kitchen cabinet, opened it again, grabbed another spoon, then closed the cabinet and placed the second spoon on the kitchen table. Afterward, he walked to the bathroom.\n\nEmma then walked into the kitchen, grabbed a wineglass and the spoon that Ethan had previously placed on the kitchen table. She moved to the living room and proceeded to the coffee table where she placed the spoon.",
    "766": "Daniel walked into the kitchen, headed to the stove, opened it, and grabbed a carrot. He then closed the stove and walked to the fridge, opened it, and placed the carrot inside. He walked back to the stove, opened it, and grabbed another carrot, which he also placed inside the fridge before closing the fridge and walking to the bathroom. Later, Mia walked to the fridge, opened it, grabbed the carrot Daniel previously placed, closed the fridge, and took the carrot to the kitchen table, placing it there.",
    "848": "Steve walked into the kitchen, headed to the stove, opened it, and grabbed a piece of bread. He then closed the stove and walked to the fridge, placing the bread inside. Afterward, he walked to the bathroom.\n\nLater, Emily walked into the kitchen, went to the fridge, opened it, and grabbed the same piece of bread that Steve had placed inside. She then closed the fridge, walked to the kitchen table, and placed the bread on it.",
    "865": "Jason walked into the kitchen, went to a kitchen cabinet, opened it, and grabbed a piece of bread. He closed the cabinet, walked to the fridge, opened it, placed the bread inside, and then closed the fridge. He then walked into the bathroom. Shortly after, Sara walked into the kitchen, went to the fridge, opened it, grabbed the same piece of bread Jason had placed inside, and closed the fridge. She moved to the kitchen table and put the bread on it.",
    "895": "Mike walked into the kitchen, moved to a kitchen cabinet, opened it, and grabbed a potato from inside. He then closed the cabinet and walked to the fridge. Mike opened the fridge and placed the potato inside. He then walked back to another kitchen cabinet, opened it, and grabbed another potato. Mike closed this cabinet and returned to the fridge, placing the second potato inside and closing the fridge. He then walked toward the bathroom.\n\nAfterward, Jenny walked to the fridge, opened it, and grabbed a potato Mike had previously put inside. She closed the fridge and moved to the kitchen table, where she placed the potato. Jenny then returned to the fridge, opened it again, and grabbed another potato Mike had placed earlier. She closed the fridge, walked over to the kitchen table, and put the second potato on the table.",
    "910": "Alex walked into the kitchen, approached a kitchen cabinet, opened it, and grabbed a potato. He then closed the cabinet and walked over to the fridge. He opened the fridge and placed the potato inside, then closed the fridge and walked into the bathroom. Later, Mia walked into the kitchen, went to the fridge, opened it, and retrieved the potato previously placed by Alex. She then closed the fridge, walked to the kitchen counter, and put the potato on the counter.",
    "956": "Ethan walked into the kitchen, headed to a kitchen cabinet, opened it, and grabbed a potato. He closed the cabinet, opened the fridge, and placed the potato inside. He then walked back to the kitchen cabinet, opened it again, grabbed another potato, closed the cabinet, and placed the second potato in the fridge before closing the fridge and walking to the bathroom.\n\nLater, Amelia walked into the kitchen, opened the fridge, grabbed the two potatoes Ethan had put inside, and placed them on the kitchen table.",
    "1811": "David walked to the stove, opened it and grabbed a loaf of bread. He closed the stove and placed the bread on the kitchen counter. He repeated the sequence, grabbing another loaf and placing it on the same kitchen counter. Then, he walked toward the bathroom. \n\nLater, Olivia entered the kitchen, and walked to the bread on the kitchen counter, grabbing both loaves that David previously placed. She then walked to the kitchen table and placed both bread loaves there.",
    "1856": "James walked into the kitchen, went to the fridge, opened it, and grabbed a carrot. He closed the fridge, walked to the kitchen table, and put the carrot down. He then returned to the fridge, opened it again, got another carrot, closed the fridge, and put the second carrot on the kitchen table. After that, Sarah walked into the kitchen, grabbed the two carrots that James previously placed on the kitchen table, and moved them to the kitchen counter.",
    "2559": "David walked to a book, grabbed it along with another book. He then walked to the living room, headed to the bedroom, and finally reached the desk there, placing both books on the desk. David then moved to the bathroom.\n\nLater on, Sarah entered the bedroom, walked to the desk, and grabbed the book previously placed by David. She then walked to the living room and placed the book down on the coffee table.",
    "3050": "Jake walked into the kitchen and opened a kitchen cabinet to grab a juice, then closed the cabinet. He moved the juice to the coffee table in the living room. Then, he walked to the bathroom.\n\nMeanwhile, Emily walked into the living room, grabbed the same juice that Jake previously placed, and moved it back to the kitchen. She placed the juice on the kitchen table.",
    "3058": "Steve walked into the kitchen, approached and opened the microwave. He grabbed a wineglass from the microwave, closed it, and placed the wineglass on the coffee table. He then walked into the bathroom. Later, Karen walked into the living room, grabbed the same wineglass Steve placed on the coffee table, and moved it to the kitchen, placing it on the kitchen table.",
    "3068": "David walked into the kitchen, to the fridge, opened it, and grabbed a beer from inside. Then, he closed the fridge, walked to the microwave, opened it, and grabbed a wineglass before closing the microwave. He then walked into the bedroom and placed the beer and wineglass on the coffee table. After that, he walked into the bathroom.\n\nLater, Sarah approached the coffee table, grabbed the same beer and wineglass David had placed, and headed to the kitchen. She moved to the kitchen counter and placed the beer and wineglass there.",
    "3315": "Jake walked to a cabinet, opened it, and grabbed a set of notes. He closed the cabinet and moved to a coffee table, placing the notes on it. He then walked to a magazine, grabbed it, and placed it on the same coffee table. Afterward, he walked into the bathroom.\n\nLater, Emily walked into the living room, grabbed the magazine that Jake placed earlier on the coffee table, and walked into the bedroom. She then walked to a desk and placed the magazine on it.",
    "129": "Lena walked into the bedroom and approached a cabinet, opening it and grabbing a wineglass. She closed the cabinet and moved the wineglass to a coffee table inside the bedroom. She then left for the bathroom.\n\nLater, Michael walked into the bedroom and grabbed the wineglass Lena had placed on the coffee table. He then walked into the kitchen and subsequently to the dishwasher, opening it and placing the wineglass inside.",
    "152": "Mia walked into the bedroom, grabbed a mug, and moved it to coffee table inside livingroom. She then walked to the bathroom. Subsequently, Jack entered the living room, grabbed the same mug Mia previously placed, and moved it to the kitchen. He placed it into the dishwasher and closed it.",
    "161": "Maria walked into the bedroom, grabbed a mug and moved it to the coffeetable inside livingroom. Next, she walked into the bathroom. Meanwhile, John walked into the living room, grabbed the same mug that Maria previously moved there, walked into the kitchen, and placed it in the dishwasher, before closing it.",
    "225": "Emily walked to a mug, grabbed it, and placed it on the kitchen table. She then walked to the bathroom. Meanwhile, Sean walked to the kitchen, grabbed another mug placed by Emily previously, and then walked to the dishwasher. He opened the dishwasher and placed the mug inside.",
    "263": "Emma walked into the kitchen, opened a kitchen cabinet, grabbed a spoon and placed it on the kitchen table. She then repeated the process with another spoon from a different kitchen cabinet. Afterward, Michael walked into the kitchen, grabbed the spoon Emma previously placed, walked to the dishwasher, opened it, and placed the spoon inside. Finally, Emma walked into the bathroom.",
    "397": "Sophia walked into the bedroom and headed to a cabinet. She opened the cabinet, grabbed a bottle of wine, closed the cabinet, and placed the wine on the coffeetable inside the livingroom. She then walked into the bathroom. Later, Jackson walked to the wineglass, grabbed previously placed wine bottle, and moved it to the coffeetable inside the livingroom and placed it there.",
    "578": "Emily walked into the kitchen, approached a kitchen cabinet, opened it and grabbed a spoon. She closed the kitchen cabinet and then walked to the bedroom, placing the spoon on the coffee table. Subsequently, she walked to the bathroom.\n\nMeanwhile, James walked to the bedroom, picked up the spoon Emily previously placed on the coffee table, and carried it to the kitchen. He then placed the spoon on the kitchen table.",
    "583": "Emma walked into the bedroom, grabbed two spoons, and carried them to the kitchen, placing each on the kitchen table. She then walked to the bathroom. Meanwhile, David walked into the kitchen, grabbed one of the spoons Emma placed on the kitchen table, and walked to the bathroom. After that, he walked to the bedroom, where he placed the spoon on a coffee table.",
    "601": "Claire walked into the kitchen, opened a kitchen cabinet, took a spoon from it, and closed the cabinet. She then took the spoon to the kitchentable. After that, she walked into the bathroom.\n\nShortly after, Mike walked into the kitchen, walked to the table, picked up the spoon that Claire had previously placed, and moved it to the coffeetable inside the bedroom.",
    "609": "Mia walked into the kitchen, went to a kitchen cabinet, opened it and grabbed a spoon. She closed the cabinet, walked toward the kitchen table and placed the spoon. She then walked into the bathroom. Later Alex walked into the kitchen, grabbed the spoon Mia had previously placed on the kitchen table, and moved it to the coffee table in the living room.",
    "640": "Hannah walked into the kitchen and grabbed a wineglass. She then walked to a spoon, grabbed it, and moved to the bedroom. She passed through the living room and placed the spoon on a coffee table there. She then returned to the bedroom, grabbed a mug, and went back to the living room to place it on the coffee table. She concluded by walking to the bathroom. \n\nMichael then walked into the living room, grabbed the mug Hannah had previously placed on the coffee table, and carried it to the kitchen where he placed it on the kitchen table.",
    "644": "Emma walked into the kitchen, opened the fridge, grabbed a bottle of wine, and then closed the fridge. She carried the wine to the kitchen table and placed it there. She then walked into the bathroom.\n\nMeanwhile, Jacob walked to a wineglass, grabbed the same bottle of wine that Emma had placed on the kitchen table, and carried it to the living room, where he placed it on the coffee table.",
    "682": "Sarah walked into the kitchen, went to a mug, grabbed it, walked to the living room, then placed the mug on the coffee table. She then walked to the bathroom. Meanwhile, Michael walked to the same mug that Sarah previously put on the coffee table, grabbed it, walked to the kitchen, and placed it on the kitchen table.",
    "784": "Lily walked into the kitchen, headed to the stove, opened it, and grabbed a carrot from inside. She then closed the stove and walked to the fridge, opened it, and put the carrot inside before closing the fridge and walking into the bathroom. Later, Matt walked into the kitchen, headed to the fridge, opened it, and grabbed the carrot that Lily had placed earlier. He then closed the fridge and walked to the kitchen table, placing the carrot on it.",
    "801": "Emma walked into the kitchen, opened a kitchen cabinet, grabbed a potato, closed the cabinet, and moved to the fridge. She opened the fridge and placed the potato inside. Then, she opened another kitchen cabinet, grabbed another potato, closed the cabinet, and placed this potato inside the fridge too, before closing the fridge and walking to the bathroom. Later, John went to the fridge, opened it, grabbed the potato Emma had placed inside, closed the fridge, walked to the kitchen table, and put the potato on the table.",
    "824": "Sara walked into the kitchen and opened a kitchen cabinet. He grabbed a potato and closed the cabinet, then walked to the fridge. After openning the fridge, he placed the potato inside, closed the fridge, and walked into the bathroom. Later, John walked to the fridge, opened it, and grabbed the potato Sara had placed earlier. He closed the fridge, walked to the kitchen table, and placed the potato there.",
    "857": "Rachel walked to a kitchen cabinet, opened it, grabbed a loaf of bread, and closed the cabinet. She then walked to the fridge, opened it, placed the bread inside, and closed the fridge. She proceeded to walk to the bathroom. Later, Michael walked into the kitchen, walked to the fridge, opened it, grabbed the same loaf of bread Rachel had placed inside, and closed the fridge. He then walked to the kitchen table and put the bread on it.",
    "913": "Emily walked into the kitchen and headed towards the stove. She opened it and grabbed a bread, then closed the stove. She moved to the fridge, opened it, placed the bread inside, and closed the fridge. She then walked to the bathroom. \n\nLater, Luke walked into the kitchen, went to the fridge, opened it, grabbed the bread previously placed by Emily, and closed the fridge. He walked over to the kitchen table and put the bread down on it.",
    "1131": "Jessica walked into the kitchen, grabbed a carton of milk, and moved to the fridge. She opened the fridge, placed the milk inside, and then closed it. She then walked to the bathroom. Later, Michael walked into the kitchen, approached the fridge, opened it, and grabbed the milk that Jessica previously placed. He closed the fridge, walked to the bedroom, and placed the milk on the coffee table.",
    "1817": "Lily walked to the stove, opened it, grabbed a potato and closed the stove. He then walked to a kitchen table and placed the potato there. Next, he repeated the process: walked to the stove, opened it, grabbed another potato, closed the stove, and placed the second potato on the kitchen table. He then walked into the bathroom.\n\nMeanwhile, Dave walked into the kitchen, went to the kitchen table, and grabbed one of the potatoes that Lily had previously placed there. He moved the potato to the kitchen counter. Then he went back to the kitchen table, grabbed the second potato that Lily had placed, and moved it to the kitchen counter as well.",
    "1819": "Sophia walked into the kitchen, approached the stove, opened it, and grabbed a potato before closing the stove. She put the potato on the kitchen counter, then walked to the bathroom. Afterward, Jack walked to the kitchen counter where she placed the potato previously, grabbed it, and moved it to a kitchen table.",
    "2462": "Emily walked to a set of notes and picked them up. She then moved through the kitchen and living room, and finally placed the notes on a desk inside the living room. Afterward, James walked to the same set of notes that Emily placed on the desk, grabbed them, moved to a coffee table and placed them there.",
    "3077": "Emma walked to grab a bottle of wine and carried it first to the living room, then to the kitchen. She placed the wine on the kitchen table and walked into the bathroom.\n\nLiam walked to grab another bottle of wine that Emma previously placed. He carried it to the bedroom and put the wine on the coffee table.",
    "42": "Jake walked into the kitchen and headed towards the fridge. He opened the fridge, grabbed a juice, closed the fridge, and placed the juice on the kitchen table. He then walked towards the bathroom. After this, Olivia walked into the kitchen, grabbed the juice that Jake placed on the kitchen table, and headed to the fridge. She opened the fridge, placed the juice inside, and then closed the fridge.",
    "128": "James walked into the bedroom, grabbed a mug and moved it to the coffeetable inside livingroom. After that he walked into the bathroom. Later, Olivia walked into the livingroom, grabbed the same mug James placed earlier, and moved it to the kitchen. She then walked to the dishwasher, opened it, placed the mug inside, and closed the dishwasher.",
    "130": "Michael walked to a kitchen cabinet, opened it, grabbed a spoon, and then closed it. He carried the spoon to the kitchen table and placed it there. Afterward, Sarah walked into the kitchen. She approached the same spoon previously placed by Michael, grabbed it, went to the dishwasher, opened it, put the spoon inside, and then closed the dishwasher.",
    "144": "Alex walked to a wineglass, grabbed it, and moved it to kitchentable. He then walked to bathroom. Afterward, Mary walked into the kitchen, grabbed the same wineglass Alex previously placed, and carried it to dishwasher. She opened the dishwasher and placed the wineglass inside.",
    "154": "Jake walked into the bedroom and grabbed a mug. He then walked to the kitchen and put the mug on the kitchen table, afterwards heading to the bathroom. Later on, Sarah walked into the kitchen, grabbed the same mug Jake had placed on the kitchen table, walked to the dishwasher, opened it, put the mug inside, and closed the dishwasher.",
    "223": "Alex walked into the kitchen, approached a mug, and grabbed another mug beside it. He then walked over to the kitchen table and placed the mug there. After that, he walked into the bathroom. Later, Sarah walked into the kitchen, grabbed the mug Alex had placed on the kitchen table, then moved to the dishwasher. She opened the dishwasher, put the mug inside, and closed it.",
    "393": "Tom walked to the bedroom, grabbed a wineglass, and moved it to the coffeetable inside livingroom. Later, Jane walked to the same wineglass that Tom previously moved, grabbed it, moved it to the kitchen, and placed it on the kitchen table. Tom then walked into the bathroom.",
    "404": "Mark walked into the kitchen, approached a kitchen cabinet, opened it, grabbed a wineglass, and closed the cabinet. He then moved to the living room and placed the wineglass on the coffee table. After that, he headed to the bathroom. Meanwhile, Laura walked into the kitchen, made her way to the living room, grabbed the wineglass that Mark had placed, returned to the kitchen, and put the wineglass on the kitchen table.",
    "528": "Daniel walked to a spoon, grabbed it, and moved it to the kitchen and then to the bedroom, placing it on a coffee table. Returning to the kitchen, he opened a kitchen cabinet to grab another spoon and took it to the bedroom, placing it on the coffee table. He then walked to the bathroom.\n\nSophie walked into the bedroom, picked up the spoon Daniel had previously placed, and moved it to the living room, placing it on the coffee table.",
    "541": "Mark walked into the kitchen, to the fridge, and opened it. He grabbed a juice, closed the fridge, walked to the living room, and placed the juice on the coffee table. He then walked to the bathroom. Later, Rachel walked to the living room, grabbed the same juice Mark placed there previously, walked to the kitchen, and placed the juice on the kitchen table.",
    "548": "Michael walked to the mug, grabbed it, and moved it to the coffeetable in the bedroom. He then headed to the bathroom. Later, Emma walked into the bedroom, grabbed the mug Michael had placed, and carried it to the kitchen, where she placed it on the kitchen table.",
    "549": "Kevin walked into the living room, grabbed a spoon, and then moved it to the coffee table inside the bedroom. Next, he walked into the bathroom. Later, Emily walked into the bedroom, grabbed the same spoon that Kevin had just placed on the coffee table, and moved it to the coffee table inside the living room.",
    "557": "Jake walked into the living room, grabbed a spoon, and brought it to the kitchen, placing it on the kitchen table. He then walked to the bathroom. Later, Emily walked into the kitchen, grabbed the same spoon from the kitchen table, and took it to the bedroom where she placed it on the coffee table.",
    "634": "James walked into the kitchen, grabbed a spoon and placed it on the kitchen table. He then walked into the bathroom. Meanwhile, Sarah walked into the kitchen, grabbed the spoon that James previously placed on the kitchen table, and moved it to the coffee table in the living room.",
    "790": "Tim walked into the kitchen, then headed towards the stove. He opened it, grabbed a potato from inside, and then closed the stove. He then went to fridge, opened it, placed the potato inside, and closed fridge afterward. He then walked towards the bathroom.\n\nLater, Olivia walked to fridge, opened it, grabbed the same potato that Tim had placed earlier, then closed the fridge again. She moved towards kitchentable and placed the potato on it.",
    "871": "Alex walked into the kitchen, headed to the stove, opened it, and grabbed a potato from it. He then closed the stove and walked to the fridge. He opened the fridge and placed the potato inside before walking to the bathroom. \n\nLater, Sarah walked into the kitchen and went to the fridge. She opened the fridge, grabbed the potato that Alex previously placed, closed the fridge, and walked to the kitchen table where she put the potato down.",
    "905": "Ethan walked into the kitchen, grabbed a carrot, and walked to the fridge. He opened the fridge and placed the carrot inside before closing it and heading to the bathroom. Later, Olivia walked into the kitchen, walked over to the fridge, and opened it. She grabbed the same carrot Ethan had placed inside, closed the fridge, then moved towards the kitchen table and placed the carrot on it.",
    "1758": "John walked into the kitchen, approached the stove, opened it, and grabbed a potato. He closed the stove and walked to the kitchen table, placing the potato on it. Then, he walked to the bathroom. Later, Anna walked over to the same potato John had placed on the kitchen table, grabbed it, and moved it to the kitchen counter.",
    "1818": "Michael walked into the kitchen and approached the fridge. He opened the fridge, grabbed a piece of bread and closed the fridge. He then walked to the kitchen counter and placed the bread on it. Next, he went to a kitchen cabinet, opened it, grabbed another piece of bread, closed the cabinet, and placed that bread on the kitchen counter as well. After that, he walked into the bathroom.\n\nLater, Sarah walked into the kitchen, went to the kitchen counter, and grabbed the two pieces of bread that Michael had previously placed there. She then walked to the kitchen table, placed both pieces of bread on it, and did nothing further.",
    "2053": "John walked into the bedroom towards a cabinet. He opened the cabinet, grabbed a wineglass, and closed it. He then walked into the kitchen and approached the dishwasher. After opening the dishwasher, he placed the wineglass inside and closed it. Next, he walked into the bathroom.\n\nLater, Emma walked towards the dishwasher in the kitchen, opened it, and grabbed the wineglass John had placed earlier. She then closed the dishwasher and moved to the kitchen table. Emma placed the wineglass on the kitchen table.",
    "2070": "Ethan walked into the livingroom, grabbed a wineglass and carried it to the kitchen. He opened the dishwasher there and placed the wineglass inside before closing it. Ethan then walked into the bathroom.\n\nLater, Olivia walked into the kitchen. She approached the dishwasher, opened it, retrieved the same wineglass Ethan had placed inside, and then put it back on the kitchen counter.",
    "3074": "Mark walked into the kitchen and went to the fridge. He opened the fridge, grabbed a juice box, closed the fridge, and placed the juice on the kitchen table. He then walked to the bathroom. Afterward, Lisa walked into the kitchen, grabbed the juice Mark had placed previously on the kitchen table, moved it to the kitchen counter, and left it there.",
    "3092": "Ryan began by walking into the kitchen, heading to the microwave. He opened it, grabbed a wineglass, and then closed the microwave. He moved the wineglass to the kitchen table and then walked to the bedroom. He grabbed a bottle of wine and moved it to the kitchen table. Ryan then walked to the bathroom.\n\nShortly after, Katie walked to the wineglass on the kitchen table that Ryan placed earlier. She grabbed the wineglass and moved it to the coffee table. Katie then walked to the kitchen, grabbed the bottle of wine that Ryan placed earlier, and moved it to the coffee table in the living room.",
    "3098": "Tom walked into the kitchen, then walked to a wineglass and grabbed it. He moved it to the living room and placed it on the coffee table. After that, he walked to the bathroom.\n\nSubsequently, Sarah walked into the living room, grabbed the same wineglass Tom had previously moved, and then took it to the kitchen, where she placed it on the kitchen table.",
    "3129": "Mark walked into the kitchen, grabbed a wineglass, and placed it on the kitchen table. He then walked to the bathroom. Later, Amanda walked into the kitchen, also grabbed the same wineglass Mark earlier placed, and moved it to kitchen counter next to dishwasher.",
    "3130": "David walked to a wineglass, grabbed it, and placed it on the kitchen table. He then walked to the bathroom. Meanwhile, Sarah walked into the kitchen, grabbed two wineglasses including the one David previously placed, and moved them to the kitchen table inside another room.",
    "3308": "Paul walked to a folder, picked it up, then moved it to the kitchen and placed it on the kitchen table. He then walked into the bedroom, grabbed a book and carried it back to kitchen, placing it on the same kitchen table, and walked into the bathroom. Later, Sarah walked into the kitchen, grabbed the folder that Paul had placed earlier, moved it to the living room, and placed it on the coffee table."
}